fragments.headline.slogan=\u0420\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u043D\u0430 JAVA
fragments.navbar.home=\u0413\u043B\u0430\u0432\u043D\u0430\u044F
fragments.navbar.about=\u041E\u0431\u043E \u043C\u043D\u0435
fragments.navbar.skills=\u0422\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438
fragments.navbar.projects=\u041F\u043E\u0440\u0442\u0444\u043E\u043B\u0438\u043E
fragments.navbar.contacts=\u041A\u043E\u043D\u0442\u0430\u043A\u0442\u044B
fragments.navbar.logout=\u0412\u044B\u0439\u0442\u0438
fragments.navbar.sign_up=\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F
fragments.navbar.login=\u0412\u0445\u043E\u0434
fragments.footer.home=\u0413\u043B\u0430\u0432\u043D\u0430\u044F
fragments.footer.contacts=\u041A\u043E\u043D\u0442\u0430\u043A\u0442\u044B


notification.message-sent=\u0421\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u043E
notification.close=\u0417\u0430\u043A\u0440\u044B\u0442\u044C
notification.message-failed=\u041E\u0448\u0438\u0431\u043A\u0430 \u043F\u0440\u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043A\u0435 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F
notification.error-code=\u041A\u043E\u0434 \u043E\u0448\u0438\u0431\u043A\u0438


index.head.title=\u0410\u043D\u0442\u043E\u043D \u0428\u0435\u043B\u0435\u043D\u043A\u043E\u0432
index.resume=\u0420\u0435\u0437\u044E\u043C\u0435
index.title=Java \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A \u0410\u043D\u0442\u043E\u043D \u0428\u0435\u043B\u0435\u043D\u043A\u043E\u0432
index.content1=\u0421\u043E\u0437\u0434\u0430\u044E \u0432\u043D\u0443\u0442\u0440\u0438\u043A\u043E\u0440\u043F\u043E\u0440\u0430\u0442\u0438\u0432\u043D\u044B\u0435 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u044B \u0438 \u043A\u043B\u0438\u0435\u043D\u0442-\u0441\u0435\u0440\u0432\u0435\u0440\u043D\u044B\u0435 \u0441\u0438\u0441\u0442\u0435\u043C\u044B, \
  \u0430 \u0442\u0430\u043A\u0436\u0435 \u0443\u043B\u0443\u0447\u0448\u0430\u044E \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0435. \u0427\u0442\u043E\u0431\u044B \u0434\u043E\u0431\u0438\u0442\u044C\u0441\u044F \u0432\u044B\u0441\u043E\u043A\u043E\u0439 \u0441\u043A\u043E\u0440\u043E\u0441\u0442\u0438 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u0438 \
  \u043B\u0451\u0433\u043A\u043E\u0433\u043E \u0441\u043E\u043F\u0440\u043E\u0432\u043E\u0436\u0434\u0435\u043D\u0438\u044F \u043F\u0440\u043E\u0434\u0443\u043A\u0442\u0430, \u044F \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044E \u0430\u043A\u0442\u0443\u0430\u043B\u044C\u043D\u044B\u0435 \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A\u0438 \u0438 \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438. \
  \u041E\u0441\u043E\u0431\u043E\u0435 \u0432\u043D\u0438\u043C\u0430\u043D\u0438\u0435 \u0443\u0434\u0435\u043B\u044F\u044E \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0430\u043D\u0438\u044E \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0430 \u043A\u043E\u0434\u043E\u0432\u043E\u0439 \u0431\u0430\u0437\u044B \u0438 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u043C\u0443 \
  \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044E. \u0412\u043C\u0435\u0441\u0442\u0435 \u0441 \u043E\u0442\u043B\u0430\u0436\u0435\u043D\u043D\u044B\u043C\u0438 \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0430\u043C\u0438 \u0434\u043E\u0441\u0442\u0430\u0432\u043A\u0438 \u0438 \u0440\u0430\u0437\u0432\u0435\u0440\u0442\u044B\u0432\u0430\u043D\u0438\u044F \u043A\u043E\u0434\u0430 \
  \u044D\u0442\u043E \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0440\u0430\u0431\u043E\u0442\u0443 \u043A\u043E\u043C\u0430\u043D\u0434\u044B \u0438 \u043F\u043E\u0432\u044B\u0441\u0438\u0442\u044C \u0443\u0441\u043F\u0435\u0445 \u043F\u0440\u043E\u0434\u0443\u043A\u0442\u0430 \u0441\u0440\u0435\u0434\u0438 \
  \u043A\u043E\u043D\u0435\u0447\u043D\u044B\u0445 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439.
index.content2=\u041E\u0441\u043D\u043E\u0432\u043D\u043E\u0435 \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u043C\u043E\u0435\u0439 \u0434\u0435\u044F\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438 - \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u0431\u044D\u043A\u0435\u043D\u0434\u0430 \
  \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0439. \u042F \u0440\u0430\u0437\u0431\u0438\u0440\u0430\u044E\u0441\u044C \u0432 \u043C\u0438\u043A\u0440\u043E\u0441\u0435\u0440\u0432\u0438\u0441\u043D\u043E\u0439 \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u0443\u0440\u0435, \u0437\u043D\u0430\u044E \u043A\u0430\u043A \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u043E\u0432\u0430\u0442\u044C \
  \u0431\u0435\u0437\u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u044C \u0441\u0430\u0439\u0442\u0430 \u0438 \u043A\u0430\u043A \u043F\u043E\u0441\u0442\u0440\u043E\u0438\u0442\u044C \u0443\u0434\u043E\u0431\u043D\u043E\u0435 API. \u0423\u043C\u0435\u044E \u0438\u043D\u0442\u0435\u0433\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0441\u0438\u0441\u0442\u0435\u043C\u0443 \
  \u0441\u043E \u0441\u0442\u043E\u0440\u043E\u043D\u043D\u0438\u043C\u0438 \u0441\u0435\u0440\u0432\u0438\u0441\u0430\u043C\u0438 \u0438 \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0441 \u043F\u0443\u0431\u043B\u0438\u0447\u043D\u044B\u043C\u0438 \u0431\u043B\u043E\u043A\u0447\u0435\u0439\u043D\u0430\u043C\u0438.
index.content3=\u0414\u043B\u044F \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u0430\u0446\u0438\u0438 \u044D\u0444\u0444\u0435\u043A\u0442\u0438\u0432\u043D\u043E\u0433\u043E \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0430 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u043D\u0430\u0441\u0442\u0440\u043E\u0438\u0442\u044C \u043C\u043D\u043E\u0436\u0435\u0441\u0442\u0432\u043E \
  \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u043E\u0432 \u0438\u043D\u0444\u0440\u0430\u0441\u0442\u0440\u0443\u043A\u0442\u0443\u0440\u044B, \u0442\u0430\u043A\u0438\u0445 \u043A\u0430\u043A \u0441\u0435\u0440\u0432\u0435\u0440 \u043D\u0435\u043F\u0440\u0435\u0440\u044B\u0432\u043D\u043E\u0439 \u0438\u043D\u0442\u0435\u0433\u0440\u0430\u0446\u0438\u0438 \u0438 \u0438\u043D\u0441\u0442\u0440\u0443\u043C\u0435\u043D\u0442\u044B \u043C\u043E\u043D\u0438\u0442\u043E\u0440\u0438\u043D\u0433\u0430 \
  \u0441\u0438\u0441\u0442\u0435\u043C\u044B. \u042F \u0437\u043D\u0430\u043A\u043E\u043C \u0441 \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u043C\u0438 \u0438\u0437 \u043D\u0430\u0438\u0431\u043E\u043B\u0435\u0435 \u043F\u043E\u043F\u0443\u043B\u044F\u0440\u043D\u044B\u0445 \u0440\u0435\u0448\u0435\u043D\u0438\u0439 \u0438 \u043C\u043E\u0433\u0443 \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u043E\u0432\u0430\u0442\u044C \
  \u043F\u043E\u0434\u043E\u0431\u043D\u0443\u044E \u0441\u0438\u0441\u0442\u0435\u043C\u0443 \u0434\u043B\u044F \u0442\u0435\u0441\u0442\u043E\u0432\u043E\u0433\u043E \u043A\u043E\u043D\u0442\u0443\u0440\u0430. \u041D\u043E \u0434\u043B\u044F \u0431\u0435\u0437\u043E\u043F\u0430\u0441\u043D\u043E\u0439 \u0438 \u044D\u0444\u0444\u0435\u043A\u0442\u0438\u0432\u043D\u043E\u0439 \u044D\u043A\u0441\u043F\u043B\u0443\u0430\u0442\u0430\u0446\u0438\u0438 \
  \u0431\u043E\u0435\u0432\u043E\u0433\u043E \u043E\u043A\u0440\u0443\u0436\u0435\u043D\u0438\u044F \u0432\u0430\u043C \u043F\u043E\u043D\u0430\u0434\u043E\u0431\u0438\u0442\u0441\u044F \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u044B\u0439 \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u0438\u0441\u0442. \u0415\u0441\u043B\u0438 \u0432\u044B \u043D\u0435 \u0437\u043D\u0430\u0435\u0442\u0435 \u043A \u043A\u043E\u043C\u0443 \u043E\u0431\u0440\u0430\u0442\u0438\u0442\u044C\u0441\u044F, \
  \u0442\u043E \u043C\u043E\u0433\u0443 \u043F\u043E\u0441\u043E\u0432\u0435\u0442\u043E\u0432\u0430\u0442\u044C \u0437\u043D\u0430\u044E\u0449\u0435\u0433\u043E \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430.
index.content4=\u042F \u0441\u0442\u0430\u0440\u0430\u044E\u0441\u044C \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E \u0447\u0438\u0441\u0442\u043E, \u0441 \u043E\u0433\u043B\u044F\u0434\u043A\u043E\u0439 \u043D\u0430 \
  \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u0432 \u0431\u0443\u0434\u0443\u0449\u0435\u043C. \u041C\u043D\u0435 \u0432\u0430\u0436\u043D\u043E, \u0447\u0442\u043E\u0431\u044B, \u0432\u0438\u0434\u044F \u043C\u043E\u0439 \u043A\u043E\u0434, \u0443 \u043C\u043E\u0438\u0445 \u043A\u043E\u043B\u043B\u0435\u0433 \
  \u043D\u0435 \u0432\u043E\u0437\u043D\u0438\u043A\u0430\u043B\u043E \u0436\u0435\u043B\u0430\u043D\u0438\u0435 \u0435\u0433\u043E \u043F\u0435\u0440\u0435\u043F\u0438\u0441\u0430\u0442\u044C.
index.remark=\u041A\u043E\u0434 \u044D\u0442\u043E\u0433\u043E \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u0434\u043E\u0441\u0442\u0443\u043F\u0435\u043D \u043D\u0430 \
  <a href="https://github.com/Anshelen/portfolio">GitHub</a>


about.head.title=\u041E\u0431\u043E \u043C\u043D\u0435
about.title=\u041E\u0431\u043E \u043C\u043D\u0435
about.education.title=\u041E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u0435
about.education.content1=\u0412 15 \u043B\u0435\u0442 \u044F \u043F\u043E\u0441\u0442\u0443\u043F\u0438\u043B \u0432 \u043B\u0438\u0446\u0435\u0439 \u2116 1502 \u043F\u0440\u0438 \u041C\u042D\u0418 \u043D\u0430 \
  \u0444\u0438\u0437\u0438\u043A\u043E-\u043C\u0430\u0442\u0435\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0435 \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 (2010-2013\u0433). \u0412 \u043B\u0438\u0446\u0435\u0435 \u0444\u0438\u0437\u0438\u043A\u0430 \u0431\u044B\u043B\u0430 \
  \u043E\u0441\u043D\u043E\u0432\u043D\u044B\u043C \u043C\u043E\u0438\u043C \u0443\u0432\u043B\u0435\u0447\u0435\u043D\u0438\u0435\u043C, \u0438 \u044F \u0432\u0441\u0435\u0440\u044C\u0435\u0437 \u043D\u0430\u043C\u0435\u0440\u0435\u0432\u0430\u043B\u0441\u044F \u0441\u0432\u044F\u0437\u0430\u0442\u044C \u0441 \u043D\u0435\u0439 \u0441\u0432\u043E\u0435 \u0431\u0443\u0434\u0443\u0449\u0435\u0435.
about.education.content2=\u041F\u043E\u0441\u043B\u0435 \u043B\u0438\u0446\u0435\u044F \u044F \u043F\u043E\u0441\u0442\u0443\u043F\u0438\u043B \u0432 \u041C\u0413\u0422\u0423 \u0438\u043C. \u041D.\u042D.\u0411\u0430\u0443\u043C\u0430\u043D\u0430 \u043D\u0430 \
  \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C "\u0425\u043E\u043B\u043E\u0434\u0438\u043B\u044C\u043D\u0430\u044F, \u043A\u0440\u0438\u043E\u0433\u0435\u043D\u043D\u0430\u044F \u0442\u0435\u0445\u043D\u0438\u043A\u0430 \u0438 \u0441\u0438\u0441\u0442\u0435\u043C\u044B \u043A\u043E\u043D\u0434\u0438\u0446\u0438\u043E\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \
  \u0438 \u0436\u0438\u0437\u043D\u0435\u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D\u0438\u044F" (2013-2019\u0433). \u041D\u0430 \u043F\u0435\u0440\u0432\u044B\u0445 \u043A\u0443\u0440\u0441\u0430\u0445 \u0434\u043B\u044F \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043C\u044B \
  \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043B\u0438 Pascal \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 IDE Lazarus, \u0447\u0442\u043E \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u043B\u043E \u0440\u0430\u0437\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0442\u044C \
  \u043F\u0440\u043E\u0441\u0442\u0435\u043D\u044C\u043A\u0438\u0435 \u0433\u0440\u0430\u0444\u0438\u0447\u0435\u0441\u043A\u0438\u0435 \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u044B.
about.education.content3=\u0421 \u0442\u0435\u0445 \u043F\u043E\u0440 \u044F \u043D\u0430\u0447\u0430\u043B \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435\u043C \
  \u0438 \u043F\u0430\u0440\u0430\u043B\u043B\u0435\u043B\u044C\u043D\u043E \u0441 \u0443\u0447\u0435\u0431\u043E\u0439 \u0438\u0437\u0443\u0447\u0430\u0442\u044C Java. \u041F\u0440\u0438\u0431\u043B\u0438\u0437\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u0437\u0430 \u0433\u043E\u0434 \u044F \u043F\u0440\u043E\u0448\u0435\u043B \u043A\u0443\u0440\u0441 \
  JavaRush \u0438 \u0438\u0437\u0443\u0447\u0438\u043B \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043A\u043D\u0438\u0433 \u043F\u043E \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044E, \u0442\u0430\u043A\u0438\u0445 \u043A\u0430\u043A "\u0424\u0438\u043B\u043E\u0441\u043E\u0444\u0438\u044F \
  Java" \u0411. \u042D\u043A\u043A\u0435\u043B\u044F \u0438 "\u042D\u0444\u0444\u0435\u043A\u0442\u0438\u0432\u043D\u043E\u0435 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u043D\u0430 Java" \u0414. \u0411\u043B\u043E\u0445\u0430. \u042D\u0442\u043E \
  \u0434\u0430\u043B\u043E \u043C\u043D\u0435 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u044B\u0439 \u0431\u0430\u0433\u0430\u0436 \u0437\u043D\u0430\u043D\u0438\u0439 \u0434\u043B\u044F \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u0438\u044F \u043F\u0435\u0440\u0432\u043E\u0439 \u0440\u0430\u0431\u043E\u0442\u044B.
about.simplex-software.title=Simplex Software
about.simplex-software.content1=\u0421 2017 \u043F\u043E 2018 \u0433\u043E\u0434\u0430 \u044F \u0441\u043E\u0432\u043C\u0435\u0449\u0430\u043B \u0443\u0447\u0435\u0431\u0443 \u0432 \
  \u0438\u043D\u0441\u0442\u0438\u0442\u0443\u0442\u0435 \u0441 \u0440\u0430\u0431\u043E\u0442\u043E\u0439 \u0432 \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u043E\u0439 \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u0438 \
  <a class="text-warning" href="http://simplex-software.ru/">Simplex Software</a> \
  \u043D\u0430 \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u0438 \u043C\u043B\u0430\u0434\u0448\u0435\u0433\u043E Java \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0441\u0442\u0430. \u0412 \u044D\u0442\u043E \u0432\u0440\u0435\u043C\u044F \u044F \u043F\u043E\u0437\u043D\u0430\u043A\u043E\u043C\u0438\u043B\u0441\u044F \u0441\u043E \u0448\u0438\u0440\u043E\u043A\u0438\u043C \
  \u0441\u043F\u0435\u043A\u0442\u0440\u043E\u043C \u043D\u043E\u0432\u044B\u0445 \u0434\u043B\u044F \u043C\u0435\u043D\u044F \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0439 \u0438 \u043F\u0440\u0438\u043D\u044F\u043B \u0443\u0447\u0430\u0441\u0442\u0438\u0435 \u0432\u043E \u043C\u043D\u043E\u0433\u0438\u0445 \u043F\u0440\u043E\u0435\u043A\u0442\u0430\u0445 (\u0432 \
  \u043E\u0441\u043D\u043E\u0432\u043D\u043E\u043C web, \u043D\u043E \u0442\u0430\u043A\u0436\u0435 \u0438\u043C\u0435\u043B \u0434\u0435\u043B\u043E \u0441 \u0442\u0430\u043A\u0438\u043C\u0438 \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F\u043C\u0438 \u043A\u0430\u043A \u0431\u043B\u043E\u043A\u0447\u0435\u0439\u043D). \u0427\u0435\u0440\u0435\u0437 \
  \u0433\u043E\u0434 \u044F \u0432\u0435\u043B \u043F\u0440\u043E\u0435\u043A\u0442, \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0438\u0440\u0443\u044F \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u043E\u0439 \u043A\u043E\u043C\u0430\u043D\u0434\u044B \u0438\u0437 \u0435\u0449\u0435 \u0434\u0432\u0443\u0445 \
  \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u043E\u0432. \u042D\u0442\u043E \u0434\u0430\u043B\u043E \u043C\u043D\u0435 \u043D\u043E\u0432\u044B\u0439 \u043E\u043F\u044B\u0442 \u0432 \u043E\u0431\u043B\u0430\u0441\u0442\u0438 \u043F\u043E\u0441\u0442\u0440\u043E\u0435\u043D\u0438\u044F \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u0443\u0440\u044B \
  \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0439 \u0438 \u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u0432 \u0446\u0435\u043B\u043E\u043C. \u041E\u0434\u043D\u0430\u043A\u043E \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u041F\u041E \u0432 \u044D\u0442\u043E\u0439 \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u0438 \
  \u0447\u0430\u0441\u0442\u043E \u0432\u0435\u043B\u0430\u0441\u044C \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0443\u0441\u0442\u043E\u044F\u0432\u0448\u0435\u0433\u043E\u0441\u044F \u0441\u0442\u0435\u043A\u0430 \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0439, \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0438\u0437 \
  \u043A\u043E\u0442\u043E\u0440\u044B\u0445, \u043D\u0430 \u043C\u043E\u0439 \u0432\u0437\u0433\u043B\u044F\u0434, \u043F\u043E\u0442\u0435\u0440\u044F\u043B\u0438 \u0430\u043A\u0442\u0443\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C.
about.iqmanager.title=IQManager
about.iqmanager.content1=\u0421\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0439 \u0433\u043E\u0434 \u043F\u0430\u0440\u0430\u043B\u043B\u0435\u043B\u044C\u043D\u043E \u0441 \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u0438\u0435\u043C \u0434\u0438\u043F\u043B\u043E\u043C\u0430 \u0432 \
  \u0438\u043D\u0441\u0442\u0438\u0442\u0443\u0442\u0435, \u044F \u043F\u043B\u043E\u0442\u043D\u043E \u0437\u0430\u043D\u0438\u043C\u0430\u043B\u0441\u044F \u0438\u0437\u0443\u0447\u0435\u043D\u0438\u0435\u043C \u0432\u043E\u0441\u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u043D\u044B\u0445 \u043D\u0430 \u0441\u0435\u0433\u043E\u0434\u043D\u044F\u0448\u043D\u0438\u0439 \u0434\u0435\u043D\u044C \
  \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0439 \u0438 \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0435\u0439 \u0434\u043E\u043C\u0430\u0448\u043D\u0438\u0445 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432. \u0422\u0430\u043A\u0438\u0445 \u043A\u0430\u043A \u044D\u0442\u043E\u0442 \u0441\u0430\u0439\u0442:) \u0422\u0430\u043A\u0436\u0435 \u044F \
  \u0443\u0433\u043B\u0443\u0431\u0438\u043B \u0441\u0432\u043E\u0438 \u0437\u043D\u0430\u043D\u0438\u044F \u0432 \u043E\u0431\u043B\u0430\u0441\u0442\u0438 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u043E\u0432 \u0438 \u0438\u0437\u0443\u0447\u0438\u043B \u043E\u0441\u043D\u043E\u0432\u044B \u0442\u0430\u043A\u043E\u0433\u043E \u044F\u0437\u044B\u043A\u0430 \u043A\u0430\u043A \
  Python, \u0447\u0442\u043E \u043F\u043E\u043C\u043E\u0433\u043B\u043E \u043C\u043D\u0435 \u0432 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0437\u0430\u0446\u0438\u0438 \u043C\u043E\u0435\u0433\u043E \u0442\u0440\u0443\u0434\u0430.
about.iqmanager.content2.part1=\u0421 \u043E\u043A\u0442\u044F\u0431\u0440\u044F 2018 \u043F\u043E \u0438\u044E\u043B\u044C 2019 \u0433\u043E\u0434\u0430 \u043F\u043E\u043C\u0438\u043C\u043E \
  \u0434\u043E\u043C\u0430\u0448\u043D\u0438\u0445 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432, \u044F \u0437\u0430\u043D\u0438\u043C\u0430\u043B\u0441\u044F \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u043E\u0439 \u0441\u0435\u0440\u0432\u0438\u0441\u0430 \u043F\u043E \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u0430\u0446\u0438\u0438 \u043C\u0435\u0440\u043E\u043F\u0440\u0438\u044F\u0442\u0438\u0439
about.iqmanager.content2.part2=, \u0433\u0434\u0435 \u0432\u044B\u043F\u043E\u043B\u043D\u044F\u043B \u0440\u044F\u0434 \u0440\u0430\u0431\u043E\u0442, \u0441\u0432\u044F\u0437\u0430\u043D\u043D\u044B\u0445 \u0441 \
  \u0434\u043E\u0431\u0430\u0432\u043B\u0435\u043D\u0438\u0435\u043C \u043D\u043E\u0432\u043E\u0433\u043E \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u0430 \u0438 \u0434\u043E\u0440\u0430\u0431\u043E\u0442\u043A\u043E\u0439 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0433\u043E. \u041F\u043E\u043C\u0438\u043C\u043E \u0434\u043E\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \
  \u0431\u0435\u043A\u0435\u043D\u0434\u0430 \u0441\u0438\u0441\u0442\u0435\u043C\u044B \u044F \u0443\u0447\u0430\u0441\u0442\u0432\u043E\u0432\u0430\u043B \u0432 \u0443\u043B\u0443\u0447\u0448\u0435\u043D\u0438\u0438 \u0444\u0440\u043E\u043D\u0442\u0435\u043D\u0434\u0430 \u0441\u0430\u0439\u0442\u0430 (\u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \
  \u043F\u043E\u0434\u043A\u043B\u044E\u0447\u0430\u043B Google Maps \u0438 \u0434\u043E\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u043B \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u0441\u043A\u0438\u0435 \u043A\u0430\u043B\u0435\u043D\u0434\u0430\u0440\u0438).
about.aximetria.title=Aximetria
about.aximetria.content1.part1=\u041F\u043E\u0441\u043B\u0435 \u043E\u043A\u043E\u043D\u0447\u0430\u043D\u0438\u044F \u0438\u043D\u0441\u0442\u0438\u0442\u0443\u0442\u0430 \u044F \u0437\u0430\u043D\u0438\u043C\u0430\u043B\u0441\u044F \u0440\u0430\u0437\u0432\u0438\u0442\u0438\u0435\u043C \
  \u0431\u044D\u043A\u0435\u043D\u0434\u0430 \u0441\u0435\u0440\u0432\u0438\u0441\u0430 \u0432 \u0441\u0442\u0430\u0440\u0442\u0430\u043F\u0435
about.aximetria.content1.link=Aximetria
about.aximetria.content1.part2=, \u0433\u0434\u0435 \u043F\u0440\u043E\u0440\u0430\u0431\u043E\u0442\u0430\u043B \u0441 \u0441\u0435\u043D\u0442\u044F\u0431\u0440\u044F 2019 \u043F\u043E \u043D\u043E\u044F\u0431\u0440\u044C 2020 \u0433\u043E\u0434\u0430. \
  \u041E\u0441\u043D\u043E\u0432\u043D\u0430\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u044F \u044D\u0442\u043E\u0433\u043E \u0441\u0435\u0440\u0432\u0438\u0441\u0430 - \u0434\u0430\u0442\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F\u043C \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0441\u043E\u0432\u0435\u0440\u0448\u0430\u0442\u044C \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 \
  \u0441 \u043A\u0440\u0438\u043F\u0442\u043E\u0432\u0430\u043B\u044E\u0442\u0430\u043C\u0438. \u041D\u0430 \u044D\u0442\u043E\u043C \u043F\u0440\u043E\u0435\u043A\u0442\u0435 \u044F \u043F\u043E\u0437\u043D\u0430\u043A\u043E\u043C\u0438\u043B\u0441\u044F \u0441 \u043C\u0438\u043A\u0440\u043E\u0441\u0435\u0440\u0432\u0438\u0441\u043D\u043E\u0439 \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u0443\u0440\u043E\u0439 \u0438 \
  \u0441\u043E\u043F\u0443\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u043C\u0438 \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u044F\u043C\u0438. \u0412 \u043D\u0430\u0448\u0435\u0439 \u043A\u043E\u043C\u0430\u043D\u0434\u0435 \u043F\u043E\u043C\u0438\u043C\u043E \u043C\u0435\u043D\u044F \u0431\u044B\u043B\u043E \u043E\u043A\u043E\u043B\u043E 10 \u0447\u0435\u043B\u043E\u0432\u0435\u043A, \
  \u0432\u043A\u043B\u044E\u0447\u0430\u044F 4 Java-\u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u043E\u0432. \u0423 \u043D\u0430\u0441 \u043D\u0435 \u0431\u044B\u043B\u043E \u0447\u0435\u0442\u043A\u0438\u0445 \u0441\u0444\u0435\u0440 \u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043D\u043D\u043E\u0441\u0442\u0438, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \
  \u043C\u043D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043F\u043E\u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u043F\u0440\u0430\u043A\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0441\u043E \u0432\u0441\u0435\u043C\u0438 \u0447\u0430\u0441\u0442\u044F\u043C\u0438 \u0441\u0438\u0441\u0442\u0435\u043C\u044B. \u041D\u0430\u0438\u0431\u043E\u043B\u0435\u0435 \u043F\u043B\u043E\u0442\u043D\u043E \u044F \
  \u0437\u0430\u043D\u0438\u043C\u0430\u043B\u0441\u044F \u0441\u0438\u0441\u0442\u0435\u043C\u043E\u0439 \u0430\u043D\u0442\u0438\u0444\u0440\u043E\u0434\u0430 \u0438 \u0440\u0430\u0437\u0432\u0438\u0442\u0438\u0435\u043C \u043C\u043E\u0434\u0443\u043B\u044F \u043F\u043E \u0440\u0430\u0431\u043E\u0442\u0435 \u0441 \u0431\u043B\u043E\u043A\u0447\u0435\u0439\u043D\u043E\u043C Ethereum. \
  \u0412\u0435\u0441\u044C \u0433\u043E\u0434 \u043C\u044B \u0438\u043D\u0442\u0435\u043D\u0441\u0438\u0432\u043D\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u043B\u0438 \u043D\u0430\u0434 \u0443\u043B\u0443\u0447\u0448\u0435\u043D\u0438\u0435\u043C \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u0443\u0440\u044B \u043F\u0440\u043E\u0435\u043A\u0442\u0430, \u0432\u043D\u0435\u0434\u0440\u0435\u043D\u0438\u0435\u043C \
  event-driven \u043F\u043E\u0434\u0445\u043E\u0434\u0430.
about.aximetria.content2.part1=\u041C\u0435\u043D\u044F \u043E\u0447\u0435\u043D\u044C \u0437\u0430\u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043E\u0432\u0430\u043B\u0430 \u0442\u0435\u043C\u0430 \u043C\u0438\u043A\u0440\u043E\u0441\u0435\u0440\u0432\u0438\u0441\u043E\u0432, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \
  \u0432 \u0441\u0432\u043E\u0431\u043E\u0434\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u044F \u043F\u0440\u0438\u043A\u043B\u0430\u0434\u044B\u0432\u0430\u043B \u0443\u0441\u0438\u043B\u0438\u044F, \u0447\u0442\u043E\u0431\u044B \u0443\u043B\u0443\u0447\u0448\u0438\u0442\u044C \u0441\u0432\u043E\u0438 \u043D\u0430\u0432\u044B\u043A\u0438 \u0432 \u044D\u0442\u043E\u0439 \u0441\u0444\u0435\u0440\u0435. \
  \u0412 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0434\u043E\u043C\u0430\u0448\u043D\u0435\u0433\u043E \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u044F \u0441\u043E\u0437\u0434\u0430\u043B \u043C\u0438\u043A\u0440\u043E\u0441\u0435\u0440\u0432\u0438\u0441\u043D\u0443\u044E \u0441\u0438\u0441\u0442\u0435\u043C\u0443, \u0440\u0430\u0437\u0432\u0435\u0440\u043D\u0443\u043B \u0435\u0435 \u0432 Google \
  Cloud Platform, \u043D\u0430\u0441\u0442\u0440\u043E\u0438\u043B \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0443\u044E \u0434\u043E\u0441\u0442\u0430\u0432\u043A\u0443 \u043A\u043E\u0434\u0430 \u0432 \u043A\u043B\u0430\u0441\u0442\u0435\u0440 \u0438 \u043C\u043E\u043D\u0438\u0442\u043E\u0440\u0438\u043D\u0433 \u0441 \
  \u043F\u043E\u043C\u043E\u0449\u044C\u044E ELK. \u041E\u0431 \u044D\u0442\u043E\u043C \u043F\u0440\u043E\u0435\u043A\u0442\u0435 \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043F\u043E\u0447\u0438\u0442\u0430\u0442\u044C \u0431\u043E\u043B\u0435\u0435 \u043F\u043E\u0434\u0440\u043E\u0431\u043D\u043E \u0432 \u043C\u043E\u0435\u0439
about.aximetria.content2.link=\u0441\u0435\u0440\u0438\u0438 \u0441\u0442\u0430\u0442\u0435\u0439
about.today.title=\u0421\u0435\u0433\u043E\u0434\u043D\u044F
about.today.content1=\u041D\u0430 \u0441\u0435\u0433\u043E\u0434\u043D\u044F\u0448\u043D\u0438\u0439 \u0434\u0435\u043D\u044C \u043C\u0435\u043D\u044F \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u0443\u0435\u0442 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u0431\u044D\u043A\u0435\u043D\u0434\u0430 \u0432\u044B\u0441\u043E\u043A\u043E\u043D\u0430\u0433\u0440\u0443\u0436\u0435\u043D\u043D\u044B\u0445 \
  \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0439. \u0412 \u0431\u0443\u0434\u0443\u0449\u0435\u043C \u044F \u0431\u044B \u0445\u043E\u0442\u0435\u043B \u043F\u043E\u0443\u0447\u0430\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C \u0432 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0435 \u043C\u0430\u0441\u0448\u0442\u0430\u0431\u043D\u044B\u0445 \u0441\u0438\u0441\u0442\u0435\u043C \u043D\u0430 \
  \u0431\u0430\u0437\u0435 \u043C\u0438\u043A\u0440\u043E\u0441\u0435\u0440\u0432\u0438\u0441\u043D\u043E\u0439 \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u0443\u0440\u044B.

register.head.title=\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F
register.title=\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F
register.username=\u0418\u043C\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F
register.email=\u042D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u0430\u044F \u043F\u043E\u0447\u0442\u0430
register.password=\u041F\u0430\u0440\u043E\u043B\u044C
register.confirm-password=\u041F\u043E\u0434\u0442\u0432\u0435\u0440\u0434\u0438\u0442\u0435 \u043F\u0430\u0440\u043E\u043B\u044C
register.confirm=\u0417\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F


badRegister.head.title=\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F
badRegister.invalid-token=\u0422\u043E\u043A\u0435\u043D \u043D\u0435 \u0432\u0430\u043B\u0438\u0434\u0435\u043D
badRegister.token-expired=\u0421\u0440\u043E\u043A \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0442\u043E\u043A\u0435\u043D\u0430 \u0438\u0441\u0442\u0435\u043A
badRegister.sign_up=\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F


registrationEmailSent.head.title=\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F
registrationEmailSent.content=, \u043D\u0430 \u0432\u0430\u0448 \u0430\u0434\u0440\u0435\u0441 \u0431\u044B\u043B\u043E \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u043E \u043F\u0438\u0441\u044C\u043C\u043E \u0441\u043E \u0441\u0441\u044B\u043B\u043A\u043E\u0439 \
  \u0434\u043B\u044F \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u044F \u0432\u0430\u0448\u0435\u0439 \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u043E\u0439 \u043F\u043E\u0447\u0442\u044B.
registrationEmailSent.resend-confirmation-email=\u041E\u0442\u043F\u0440\u0430\u0432\u0438\u0442\u044C \u0435\u0449\u0435 \u0440\u0430\u0437
registrationEmailSent.login=\u0412\u043E\u0439\u0442\u0438 \u0432 \u0430\u043A\u043A\u0430\u0443\u043D\u0442


successRegistration.head.title=\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F \u0443\u0441\u043F\u0435\u0448\u043D\u0430
successRegistration.content=, \u0432\u0430\u0448 \u0430\u043A\u043A\u0430\u0443\u043D\u0442 \u0430\u043A\u0442\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u043D \u0438 \u0433\u043E\u0442\u043E\u0432 \u043A \u0440\u0430\u0431\u043E\u0442\u0435.
successRegistration.login=\u0412\u043E\u0439\u0442\u0438 \u0432 \u0430\u043A\u043A\u0430\u0443\u043D\u0442


expiredSession.head.title=\u0421\u0435\u0441\u0441\u0438\u044F \u0438\u0441\u0442\u0435\u043A\u043B\u0430
expiredSession.content=\u0412\u0430\u0448\u0430 \u0441\u0435\u0441\u0441\u0438\u044F \u0438\u0441\u0442\u0435\u043A\u043B\u0430
expiredSession.login=\u0412\u043E\u0439\u0442\u0438 \u0432 \u0430\u043A\u043A\u0430\u0443\u043D\u0442


contacts.head.title=\u041A\u043E\u043D\u0442\u0430\u043A\u0442\u044B
contacts.title=\u041A\u043E\u043D\u0442\u0430\u043A\u0442\u044B
contacts.phone=\u0422\u0435\u043B\u0435\u0444\u043E\u043D
contacts.email=\u042D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u0430\u044F \u043F\u043E\u0447\u0442\u0430
contacts.send-message.title=\u041E\u0442\u043F\u0440\u0430\u0432\u0438\u0442\u044C \u043F\u0438\u0441\u044C\u043C\u043E
contacts.send-message.name=\u0418\u043C\u044F
contacts.send-message.name.placeholder=\u0423\u043A\u0430\u0436\u0438\u0442\u0435 \u0412\u0430\u0448\u0435 \u0438\u043C\u044F
contacts.send-message.subject=\u0417\u0430\u0433\u043E\u043B\u043E\u0432\u043E\u043A
contacts.send-message.subject.placeholder=\u0423\u043A\u0430\u0436\u0438\u0442\u0435 \u0442\u0435\u043C\u0443 \u043F\u0438\u0441\u044C\u043C\u0430
contacts.send-message.body=\u0421\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435
contacts.send-message.body.placeholder=\u0417\u0430\u043F\u043E\u043B\u043D\u0438\u0442\u0435 \u0442\u0435\u043B\u043E \u043F\u0438\u0441\u044C\u043C\u0430
contacts.send-message.submit=\u041E\u0442\u043F\u0440\u0430\u0432\u0438\u0442\u044C
contacts.js.validation.name.required=\u0423\u043A\u0430\u0436\u0438\u0442\u0435 \u043E\u0442 \u043A\u043E\u0433\u043E \u043F\u0438\u0441\u044C\u043C\u043E
contacts.js.validation.name.minlength=\u0412\u0432\u0435\u0434\u0438\u0442\u0435 \u043D\u0435 \u043C\u0435\u043D\u0435\u0435 2-\u0445 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432 \u0432 \u043F\u043E\u043B\u0435 '\u0418\u043C\u044F'
contacts.js.validation.name.maxlength=\u0421\u043B\u0438\u0448\u043A\u043E\u043C \u0434\u043B\u0438\u043D\u043D\u043E\u0435 \u0438\u043C\u044F
contacts.js.validation.subject.required=\u0422\u0435\u043C\u0430 \u043F\u0438\u0441\u044C\u043C\u0430 \u043E\u0431\u044F\u0437\u0430\u0442\u0435\u043B\u044C\u043D\u0430 \u043A \u0437\u0430\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044E
contacts.js.validation.subject.minlength=\u0412\u0432\u0435\u0434\u0438\u0442\u0435 \u043D\u0435 \u043C\u0435\u043D\u0435\u0435 2-\u0445 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432 \u0432 \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043E\u043A
contacts.js.validation.subject.maxlength=\u0421\u043B\u0438\u0448\u043A\u043E\u043C \u0434\u043B\u0438\u043D\u043D\u044B\u0439 \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043E\u043A
contacts.js.validation.text.required=\u0417\u0430\u043F\u043E\u043B\u043D\u0438\u0442\u0435 \u0442\u0435\u043B\u043E \u043F\u0438\u0441\u044C\u043C\u0430
contacts.js.validation.text.maxlength=\u0421\u043B\u0438\u0448\u043A\u043E\u043C \u0434\u043B\u0438\u043D\u043D\u043E\u0435 \u043F\u0438\u0441\u044C\u043C\u043E


error.head.title=\u041E\u0448\u0438\u0431\u043A\u0430
error.explanation=\u0423\u043F\u0441... \u0427\u0442\u043E \u0442\u043E \u0441\u043B\u043E\u043C\u0430\u043B\u043E\u0441\u044C...
error.home=\u041D\u0430 \u0433\u043B\u0430\u0432\u043D\u0443\u044E


login.head.title=\u0412\u043E\u0439\u0442\u0438 \u0432 \u0441\u0438\u0441\u0442\u0435\u043C\u0443
login.title=\u0412\u0445\u043E\u0434
login.email=\u042D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u0430\u044F \u043F\u043E\u0447\u0442\u0430
login.email.placeholder=\u042D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u0430\u044F \u043F\u043E\u0447\u0442\u0430
login.password=\u041F\u0430\u0440\u043E\u043B\u044C
login.password.placeholder=\u041F\u0430\u0440\u043E\u043B\u044C
login.remember-me=\u0417\u0430\u043F\u043E\u043C\u043D\u0438\u0442\u044C \u043C\u0435\u043D\u044F
login.error.bad-credentials=\u041D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u0430\u0434\u0440\u0435\u0441 \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u043E\u0439 \u043F\u043E\u0447\u0442\u044B \u0438\u043B\u0438 \u043F\u0430\u0440\u043E\u043B\u044C
login.error.credentials-expired=\u041F\u043E\u043B\u043D\u043E\u043C\u043E\u0447\u0438\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0438\u0441\u0442\u0435\u043A\u043B\u0438
login.error.account-banned=\u0410\u043A\u043A\u0430\u0443\u043D\u0442 \u0437\u0430\u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u043D
login.error.account-disabled=\u0410\u043A\u043A\u0430\u0443\u043D\u0442 \u043D\u0435 \u0430\u043A\u0442\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u043D
login.error.no-verified-account=\u041A \u043F\u0440\u043E\u0432\u0430\u0439\u0434\u0435\u0440\u0443 \u0432\u0445\u043E\u0434\u0430 \u043D\u0435 \u043F\u0440\u0438\u0432\u044F\u0437\u0430\u043D \u0430\u0434\u0440\u0435\u0441 \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u043E\u0439 \u043F\u043E\u0447\u0442\u044B
login.send-confirmation-again=\u041F\u043E\u0432\u0442\u043E\u0440\u043D\u043E \u043E\u0442\u043E\u0441\u043B\u0430\u0442\u044C \u043F\u0438\u0441\u044C\u043C\u043E \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u044F
login.submit=\u0412\u043E\u0439\u0442\u0438
login.separator=\u0418\u043B\u0438


projects.head.title=\u041F\u043E\u0440\u0442\u0444\u043E\u043B\u0438\u043E
projects.title=\u041F\u0440\u043E\u0435\u043A\u0442\u044B, \u0432 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u044F \u0443\u0447\u0430\u0441\u0442\u0432\u043E\u0432\u0430\u043B
projects.iqmanager.title=<a href="https://iqmanager.org" target="_blank" \
  class="text-warning">IQManager</a> - \u043F\u043E\u0440\u0442\u0430\u043B \u0434\u043B\u044F \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u0430\u0446\u0438\u0438 \u043C\u0435\u0440\u043E\u043F\u0440\u0438\u044F\u0442\u0438\u0439
projects.iqmanager.content1=\u042D\u0442\u043E\u0442 \u043F\u043E\u0440\u0442\u0430\u043B \u0441\u043B\u0443\u0436\u0438\u0442 \u0434\u043B\u044F \u0441\u0432\u044F\u0437\u0438 \u0430\u0440\u0442\u0438\u0441\u0442\u043E\u0432, \u043C\u0443\u0437\u044B\u043A\u0430\u043D\u0442\u043E\u0432, \
  \u0432\u043B\u0430\u0434\u0435\u043B\u044C\u0446\u0435\u0432 \u043F\u043B\u043E\u0449\u0430\u0434\u043E\u043A \u0438 \u0434\u0440\u0443\u0433\u0438\u0445 \u0440\u0430\u0431\u043E\u0442\u043D\u0438\u043A\u043E\u0432 \u0438\u043D\u0434\u0443\u0441\u0442\u0440\u0438\u0438 \u0440\u0430\u0437\u0432\u043B\u0435\u0447\u0435\u043D\u0438\u0439 \u043D\u0430\u043F\u0440\u044F\u043C\u0443\u044E \u0441 \
  \u0437\u0430\u043A\u0430\u0437\u0447\u0438\u043A\u043E\u043C. \u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C \u043C\u043E\u0436\u0435\u0442 \u0432\u044B\u0441\u0442\u0443\u043F\u0430\u0442\u044C \u043A\u0430\u043A \u0432 \u0440\u043E\u043B\u0438 \u0437\u0430\u043A\u0430\u0437\u0447\u0438\u043A\u0430, \u0442\u0430\u043A \u0438 \
  \u0438\u0441\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044F. \u0421\u0438\u0441\u0442\u0435\u043C\u0430 \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043A\u043B\u0438\u0435\u043D\u0442\u0443 \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u043E\u0432\u0430\u0442\u044C \u043F\u0440\u0430\u0437\u043D\u0438\u043A \u043E\u043D\u043B\u0430\u0439\u043D, \u0434\u0430\u0436\u0435 \
  \u0431\u0435\u0437 \u043D\u0443\u0436\u0434\u044B \u0441\u043E\u0437\u0432\u0430\u043D\u0438\u0432\u0430\u0442\u044C\u0441\u044F \u0441 \u0438\u0441\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u0435\u043C.
projects.iqmanager.content2=\u042F \u0437\u0430\u043D\u0438\u043C\u0430\u043B\u0441\u044F \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u043E\u0439 \u044D\u0442\u043E\u0433\u043E \u043F\u0440\u043E\u0435\u043A\u0442\u0430 - \u0438\u0441\u043F\u0440\u0430\u0432\u043B\u044F\u043B \
  \u043E\u0448\u0438\u0431\u043A\u0438 \u0438 \u0434\u043E\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u043B \u043D\u043E\u0432\u044B\u0439 \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B.\u041D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0438\u0437 \u0437\u0430\u0434\u0430\u0447, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u044F \u0440\u0435\u0448\u0430\u043B \u0432 \
  \u044D\u0442\u043E\u043C \u043F\u0440\u043E\u0435\u043A\u0442\u0435:
projects.iqmanager.challenge1=\u0420\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u0440\u0430\u0431\u043E\u0447\u0438\u0445 \u043A\u0430\u043B\u0435\u043D\u0434\u0430\u0440\u0435\u0439 \u043D\u0430 JavaScript, \u0430 \
  \u0442\u0430\u043A\u0436\u0435 \u043F\u043E\u0434\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u0438 \u043A\u0430\u0441\u0442\u043E\u043C\u0438\u0437\u0430\u0446\u0438\u044F Google Maps
projects.iqmanager.challenge2=\u041F\u043E\u0434\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u044D\u043A\u0432\u0430\u0439\u0440\u0438\u043D\u0433\u0430 \u043E\u0442 \u0421\u0431\u0435\u0440\u0431\u0430\u043D\u043A\u0430, \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \
  \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u0438 \u0447\u0430\u0441\u0442\u0438\u0447\u043D\u043E\u0439 \u043E\u043F\u043B\u0430\u0442\u044B \u0438 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0430 \u0441\u0440\u0435\u0434\u0441\u0442\u0432
projects.iqmanager.challenge3=\u041F\u0440\u043E\u0444\u0438\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0438 \u0443\u0441\u0442\u0440\u0430\u043D\u0435\u043D\u0438\u0435 \u0443\u0437\u043A\u0438\u0445 \u043C\u0435\u0441\u0442 \u0441\u0438\u0441\u0442\u0435\u043C\u044B, \
  \u0447\u0442\u043E \u0443\u0441\u043A\u043E\u0440\u0438\u043B\u043E \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0443 \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0441\u0442\u0440\u0430\u043D\u0438\u0446 \u043D\u0430 \u043F\u043E\u0440\u044F\u0434\u043E\u043A
projects.iqmanager.challenge4=\u0414\u043E\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u043F\u043E\u043B\u043D\u043E\u0442\u0435\u043A\u0441\u0442\u043E\u0432\u043E\u0433\u043E \u043F\u043E\u0438\u0441\u043A\u0430 \u0441\u0430\u0439\u0442\u0430 - \
  \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043D\u0435\u0447\u0435\u0442\u043A\u043E\u0433\u043E \u043F\u043E\u0438\u0441\u043A\u0430, \u0443\u043B\u0443\u0447\u0448\u0435\u043D\u0438\u0435 \u043B\u043E\u0433\u0438\u043A\u0438 \u043F\u043E\u0438\u0441\u043A\u0430, \u0430\u043D\u0430\u043B\u0438\u0437 \u0438\u043D\u0434\u0435\u043A\u0441\u043E\u0432
projects.arbitr.title=Arbitr - \u043F\u0430\u0440\u0441\u0435\u0440 \
  <a href="http://kad.arbitr.ru/" target="_blank" class="text-warning">\
  \u043A\u0430\u0440\u0442\u043E\u0442\u0435\u043A\u0438 \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043D\u044B\u0445 \u0434\u0435\u043B</a>
projects.arbitr.content1=\u042D\u0442\u043E\u0442 \u043F\u0430\u0440\u0441\u0435\u0440 \u043C\u043E\u0436\u0435\u0442 \u0438\u0437\u0432\u043B\u0435\u043A\u0430\u0442\u044C \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u043F\u043E \u0437\u0430\u0434\u0430\u043D\u043D\u043E\u043C\u0443 \
  \u0441\u043F\u0438\u0441\u043A\u0443 \u0418\u041D\u041D \u0432 \u0434\u0432\u0443\u0445 \u0440\u0435\u0436\u0438\u043C\u0430\u0445: \u0438\u0441\u0442\u043E\u0440\u0438\u0447\u0435\u0441\u043A\u043E\u043C \u0438 \u0438\u043D\u043A\u0440\u0435\u043C\u0435\u043D\u0442\u0430\u043B\u044C\u043D\u043E\u043C. \u0418\u0441\u0442\u043E\u0440\u0438\u0447\u0435\u0441\u043A\u0438\u0439 \
  \u0438\u043D\u0438\u0446\u0438\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u043C \u0438 \u0441\u0447\u0438\u0442\u044B\u0432\u0430\u0435\u0442 \u0441\u0443\u0434\u0435\u0431\u043D\u044B\u0435 \u0434\u0435\u043B\u0430 \u0437\u0430 \u0443\u0441\u043B\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0439 \
  \u043F\u0440\u043E\u043C\u0435\u0436\u0443\u0442\u043E\u043A \u0432\u0440\u0435\u043C\u0435\u043D\u0438, \u0442\u043E\u0433\u0434\u0430 \u043A\u0430\u043A \u0438\u043D\u043A\u0440\u0435\u043C\u0435\u043D\u0442\u0430\u043B\u044C\u043D\u044B\u0439 \u0440\u0435\u0436\u0438\u043C \u0437\u0430\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0440\u0435\u0433\u0443\u043B\u044F\u0440\u043D\u043E \u0432 \
  \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u043C \u0440\u0435\u0436\u0438\u043C\u0435.
projects.arbitr.content2=\u041E\u0441\u043D\u043E\u0432\u043D\u0430\u044F \u0442\u0435\u0445\u043D\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u0441\u043B\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0432 \u044D\u0442\u043E\u043C \u043F\u0440\u043E\u0435\u043A\u0442\u0435 \
  \u0437\u0430\u043A\u043B\u044E\u0447\u0430\u043B\u0430\u0441\u044C \u0432 \u043F\u0440\u0435\u043E\u0434\u043E\u043B\u0435\u043D\u0438\u0438 \u0437\u0430\u0449\u0438\u0442\u044B \u0441\u0430\u0439\u0442\u0430. \u042D\u0442\u0430 \u0437\u0430\u0434\u0430\u0447\u0430 \u0440\u0435\u0448\u0430\u043B\u0430\u0441\u044C \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \
  \u043F\u0440\u043E\u043A\u0441\u0438-\u0441\u0435\u0440\u0432\u0435\u0440\u043E\u0432 \u0438 \u0438\u043D\u0442\u0435\u0433\u0440\u0430\u0446\u0438\u0438 \u0441 \u0441\u0435\u0440\u0432\u0438\u0441\u043E\u043C \u0440\u0430\u0441\u0448\u0438\u0444\u0440\u043E\u0432\u043A\u0438 \u043A\u0430\u043F\u0447 \
  <a href="https://rucaptcha.com/" target="_blank" class="text-warning">Rucaptcha.com</a>. \
  \u0422\u0430\u043A\u0436\u0435 \u044D\u0442\u0430 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0430 \u0430\u043A\u0442\u0438\u0432\u043D\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442 \u043C\u043D\u043E\u0433\u043E\u043F\u043E\u0442\u043E\u0447\u043D\u043E\u0441\u0442\u044C.
projects.arbitr.content3=\u0412\u043E \u0432\u0440\u0435\u043C\u044F \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u0432 \u043C\u043E\u0438 \u043E\u0431\u044F\u0437\u0430\u043D\u043D\u043E\u0441\u0442\u0438 \u0432\u0445\u043E\u0434\u0438\u043B\u0430 \
  \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u0443\u0440\u044B \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u044B, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0440\u0430\u0431\u043E\u0442\u044B \u0435\u0449\u0435 \u0434\u0432\u0443\u0445 \
  \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0441\u0442\u043E\u0432. \u042D\u0442\u043E \u0431\u044B\u043B \u043E\u0447\u0435\u043D\u044C \u043F\u043E\u043B\u0435\u0437\u043D\u044B\u0439 \u0438 \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043D\u044B\u0439 \u043E\u043F\u044B\u0442.
projects.talksift.title=\u0424\u043E\u0440\u0443\u043C \
  <a href="http://talksift.ru/" target="_blank" class="text-warning">Talksift</a>
projects.talksift.content=\u042D\u0442\u043E \u0434\u0438\u0441\u043A\u0443\u0441\u0441\u0438\u043E\u043D\u043D\u0430\u044F \u043F\u043B\u043E\u0449\u0430\u0434\u043A\u0430 \u0434\u043B\u044F \u0432\u0435\u0434\u0435\u043D\u0438\u044F \u0441\u043F\u043E\u0440\u043E\u0432 \u043D\u0430 \
  \u043B\u044E\u0431\u044B\u0435 \u0442\u0435\u043C\u044B. \u041E\u043D\u0430 \u0438\u043C\u0435\u0435\u0442 \u043E\u0447\u0435\u043D\u044C \u0437\u0430\u043F\u0443\u0442\u0430\u043D\u043D\u0443\u044E \u0441\u0438\u0441\u0442\u0435\u043C\u0443 \u0444\u0438\u043B\u044C\u0442\u0440\u043E\u0432, \u043E\u0446\u0435\u043D\u043E\u043A, \u0440\u0435\u0439\u0442\u0438\u043D\u0433\u043E\u0432 \u0438 \
  \u0432\u0435\u0434\u0435\u043D\u0438\u044F \u0431\u0435\u0441\u0435\u0434. \u042D\u0442\u043E \u0434\u0430\u043B\u043E \u043C\u043D\u0435 \u043E\u043F\u044B\u0442 \u0440\u0430\u0431\u043E\u0442\u044B \u0441 \u043E\u0447\u0435\u043D\u044C \u043E\u0431\u044A\u0435\u043C\u043D\u044B\u043C\u0438 \u0437\u0430\u043F\u0440\u043E\u0441\u0430\u043C\u0438 \u043A \u0411\u0414 \u0438 \u0441 \
  \u0437\u0430\u043F\u0443\u0442\u0430\u043D\u043D\u043E\u0439 \u043D\u0430\u0432\u0438\u0433\u0430\u0446\u0438\u0435\u0439 \u043F\u043E \u043F\u0440\u043E\u0435\u043A\u0442\u0443.
projects.pajcoin.title=<a href="https://www.pajcoin.com/" target="_blank" class="text-warning">PajCoin</a> \
  - \u0442\u043E\u043A\u0435\u043D \u043D\u0430 \u0431\u0430\u0437\u0435 Ethereum
projects.pajcoin.content=\u041F\u0440\u043E\u0435\u043A\u0442 \u0441\u043E\u0441\u0442\u043E\u0438\u0442 \u0438\u0437 \u0442\u0440\u0435\u0445 \u0441\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0449\u0438\u0445: \u0442\u043E\u043A\u0435\u043D\u0430, \
  \u0441\u043C\u0430\u0440\u0442-\u043A\u043E\u043D\u0442\u0440\u0430\u043A\u0442\u0430 \u043E\u0431\u043C\u0435\u043D\u043D\u0438\u043A\u0430 \u0438 \u0441\u0435\u0440\u0432\u0438\u0441\u0430-\u043E\u0440\u0430\u043A\u0443\u043B\u0430. \u0422\u043E\u043A\u0435\u043D \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442 \
  ERC223 \u0438 \u043F\u0440\u0438\u0432\u044F\u0437\u0430\u043D \u043A \u0440\u0443\u0431\u043B\u044E (1 \u0442\u043E\u043A\u0435\u043D PJC = 1000 \u0440\u0443\u0431\u043B\u0435\u0439). \u0414\u043B\u044F \
  \u043F\u0440\u0438\u043E\u0431\u0440\u0435\u0442\u0435\u043D\u0438\u044F/\u043F\u0440\u043E\u0434\u0430\u0436\u0438 \u0442\u043E\u043A\u0435\u043D\u043E\u0432 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u043A\u043E\u043D\u0442\u0440\u0430\u043A\u0442-\u043E\u0431\u043C\u0435\u043D\u043D\u0438\u043A, \u043A\u0443\u0440\u0441 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \
  \u0438\u0437\u043C\u0435\u043D\u044F\u0435\u0442\u0441\u044F \u0438\u0437\u0432\u043D\u0435 \u043E\u0440\u0430\u043A\u0443\u043B\u043E\u043C. \u0411\u044B\u043B\u0430 \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u0430 \u0432\u0435\u0440\u0441\u0438\u044F, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044E\u0449\u0430\u044F \u0441\u0435\u0440\u0432\u0438\u0441 \
  Oraclize, \u043E\u0434\u043D\u0430\u043A\u043E, \u0432\u043F\u043E\u0441\u043B\u0435\u0434\u0441\u0442\u0432\u0438\u0438 \u043F\u043E \u044D\u043A\u043E\u043D\u043E\u043C\u0438\u0447\u0435\u0441\u043A\u0438\u043C \u0441\u043E\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u044F\u043C \u0431\u044B\u043B\u043E \u0440\u0435\u0448\u0435\u043D\u043E \
  \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0441\u043E\u0431\u0441\u0442\u0432\u0435\u043D\u043D\u0443\u044E \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044E. \u042D\u0442\u043E \u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u043F\u043E\u0437\u0432\u043E\u043B\u0438\u043B\u043E \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0435\u043D\u043D\u043E \
  \u0441\u043D\u0438\u0437\u0438\u0442\u044C \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u043E\u043D\u043D\u044B\u0435 \u0440\u0430\u0441\u0445\u043E\u0434\u044B (\u043F\u0440\u0438\u0431\u043B\u0438\u0437\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u0432 4 \u0440\u0430\u0437\u0430) \u0438, \u043A\u0430\u043A \u0441\u043B\u0435\u0434\u0441\u0442\u0432\u0438\u0435, \
  \u043A\u043E\u043C\u0438\u0441\u0441\u0438\u044E \u043E\u0431\u043C\u0435\u043D\u043D\u0438\u043A\u0430. \u042F \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u043B \u0443\u0447\u0430\u0441\u0442\u0438\u0435 \u0432 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0435 \u0432\u0441\u0435\u0445 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u043E\u0432 \u0441\u0438\u0441\u0442\u0435\u043C\u044B.
projects.changer.title=Changer - \u0437\u0430\u043A\u0440\u044B\u0442\u0430\u044F \u0430\u043A\u0446\u0438\u043E\u043D\u0435\u0440\u043D\u0430\u044F \u043F\u043B\u043E\u0449\u0430\u0434\u043A\u0430 \u0434\u043B\u044F Bitcoin \u0438 \
  Ethereum
projects.changer.content=\u042D\u0442\u043E\u0442 \u0440\u0435\u0441\u0443\u0440\u0441 \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043A\u043B\u0438\u0435\u043D\u0442\u0430\u043C \u043F\u0435\u0440\u0435\u0432\u043E\u0434\u0438\u0442\u044C \u043D\u0430 \u043A\u043E\u0448\u0435\u043B\u0435\u043A \
  \u0444\u0438\u0440\u043C\u044B \u043A\u0440\u0438\u043F\u0442\u043E\u0432\u0430\u043B\u044E\u0442\u0443, \u0447\u0442\u043E \u043E\u0442\u0440\u0430\u0436\u0430\u0435\u0442\u0441\u044F \u0432 \u0438\u0445 \u043B\u0438\u0447\u043D\u043E\u043C \u043A\u0430\u0431\u0438\u043D\u0435\u0442\u0435. \u0410\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u044B \u0436\u0435 \
  \u043C\u043E\u0433\u0443\u0442 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0438\u0442\u044C \u0434\u0438\u0432\u0438\u0434\u0435\u043D\u0434\u044B \u043F\u0440\u043E\u043F\u043E\u0440\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E \u0432\u043A\u043B\u0430\u0434\u0430\u043C. \u0412 \
  \u043A\u043E\u043C\u0430\u043D\u0434\u0435 \u044F \u0432\u044B\u043F\u043E\u043B\u043D\u044F\u043B \u0440\u0430\u0431\u043E\u0442\u0443 \u043F\u043E \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0437\u0430\u0446\u0438\u0438 \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u044D\u0442\u043E\u0433\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F, \
  \u0442\u0430\u043A \u043A\u0430\u043A \u0437\u0430\u043A\u0430\u0437\u0447\u0438\u043A\u0438 \u043F\u0440\u0435\u0434\u044A\u044F\u0432\u043B\u044F\u043B\u0438 \u043F\u043E\u0432\u044B\u0448\u0435\u043D\u043D\u044B\u0435 \u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u0438\u044F \u043A \u0431\u0435\u0437\u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0438 \
  \u043D\u0430\u0434\u0435\u0436\u043D\u043E\u0441\u0442\u0438. \u0412 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u0435 \u043C\u043D\u043E\u0439 \u0431\u044B\u043B\u0438 \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u044B \u0442\u0435\u0441\u0442\u044B \u043D\u0430 TestRPC \u0438 \u043F\u0440\u0438\u0432\u0430\u0442\u043D\u043E\u043C \
  \u0431\u043B\u043E\u043A\u0447\u0435\u0439\u043D\u0435.
projects.portfolio.title=\u042D\u0442\u043E\u0442 \u0441\u0430\u0439\u0442-\u043F\u043E\u0440\u0442\u0444\u043E\u043B\u0438\u043E
projects.portfolio.content=\u0412 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0434\u043E\u043C\u0430\u0448\u043D\u0435\u0433\u043E \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u044F \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0430\u043B \u044D\u0442\u043E\u0442 \
  \u0441\u0430\u0439\u0442. \u041F\u043E\u043C\u0438\u043C\u043E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u0438 \u043E\u0431\u043E \u043C\u043D\u0435 \u043E\u043D \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u043B\u043E\u0449\u0430\u0434\u043A\u043E\u0439, \u043D\u0430 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u044F \
  \u043E\u0442\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u044E \u043D\u043E\u0432\u044B\u0435 \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438.
projects.portfolio.link=\u0421\u0441\u044B\u043B\u043A\u0430 \u043D\u0430 \
  <a href="https://github.com/Anshelen/portfolio" target="_blank" class="text-warning">\u0440\u0435\u043F\u043E\u0437\u0438\u0442\u043E\u0440\u0438\u0439</a>
projects.archetype.title=\u0410\u0440\u0445\u0435\u0442\u0438\u043F quick-web-archetype
projects.archetype.content=\u0414\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u0441\u0430\u0439\u0442\u0430 \u0438 \u043D\u0430 \u0431\u0443\u0434\u0443\u0449\u0435\u0435 \u044F \u0441\u043E\u0437\u0434\u0430\u043B Maven \u0430\u0440\u0445\u0435\u0442\u0438\u043F \
  \u0434\u043B\u044F web-\u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C Spring Boot \u0438 Thymeleaf. \u0412 \u043C\u043E\u0438\u0445 \u043F\u043B\u0430\u043D\u0430\u0445 \
  \u0443\u043B\u0443\u0447\u0448\u0430\u0442\u044C \u0435\u0433\u043E \u043F\u0430\u0440\u0430\u043B\u043B\u0435\u043B\u044C\u043D\u043E \u0441 \u044D\u0442\u0438\u043C \u0441\u0430\u0439\u0442\u043E\u043C.
projects.archetype.link=\u0421\u0441\u044B\u043B\u043A\u0430 \u043D\u0430 \
  <a href="https://github.com/Anshelen/quick-web-archetype" target="_blank" class="text-warning">\u0440\u0435\u043F\u043E\u0437\u0438\u0442\u043E\u0440\u0438\u0439</a>


skills.head.title=\u0422\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438
skills.title=\u041C\u043E\u0438 \u043D\u0430\u0432\u044B\u043A\u0438
skills.more=\u041F\u043E\u0434\u0440\u043E\u0431\u043D\u0435\u0435...
skills.general.title=\u041E\u0431\u0449\u0435\u0435
skills.bmstu.title=\u041C\u0413\u0422\u0423 \u0438\u043C. \u041D.\u042D.\u0411\u0430\u0443\u043C\u0430\u043D\u0430
skills.bmstu.content=\u042F \u0438\u043C\u0435\u044E \u0432\u044B\u0441\u0448\u0435\u0435 \u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u0435 (\u043C\u0430\u0433\u0438\u0441\u0442\u0440) \u041C\u0413\u0422\u0423 \u0438\u043C. \u041D.\u042D.\u0411\u0430\u0443\u043C\u0430\u043D\u0430 \
  \u043F\u043E \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u0438 "\u0425\u043E\u043B\u043E\u0434\u0438\u043B\u044C\u043D\u0430\u044F, \u043A\u0440\u0438\u043E\u0433\u0435\u043D\u043D\u0430\u044F \u0442\u0435\u0445\u043D\u0438\u043A\u0430 \u0438 \u0441\u0438\u0441\u0442\u0435\u043C\u044B \
  \u0436\u0438\u0437\u043D\u0435\u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D\u0438\u044F" (2019\u0433).
skills.bmstu.more.content=\u042F \u0443\u0447\u0438\u043B\u0441\u044F \u0441 2013 \u043F\u043E 2019\u0433. \u0412 \u0434\u0438\u043F\u043B\u043E\u043C\u043D\u043E\u043C \u043F\u0440\u043E\u0435\u043A\u0442\u0435 \u043C\u043D\u043E\u0439 \
  \u0438\u0437\u0443\u0447\u0430\u043B\u0438\u0441\u044C \u0441\u0435\u0442\u0435\u0432\u044B\u0435 \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438 \u0438 \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u044B \u0434\u043B\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0437\u0430\u0446\u0438\u0438 \u0440\u0430\u0431\u043E\u0442\u044B \
  \u0445\u043B\u0430\u0434\u043E\u0446\u0435\u043D\u0442\u0440\u0430 \u043F\u0440\u043E\u043C\u044B\u0448\u043B\u0435\u043D\u043D\u044B\u0445 \u0437\u0434\u0430\u043D\u0438\u0439. \u0412 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u0435 \u0437\u0430\u043A\u043E\u043D\u0447\u0438\u043B \u043C\u0430\u0433\u0438\u0441\u0442\u0440\u0430\u0442\u0443\u0440\u0443 \u0441 \
  \u043A\u0440\u0430\u0441\u043D\u044B\u043C \u0434\u0438\u043F\u043B\u043E\u043C\u043E\u043C.
skills.experience.title=\u041E\u043F\u044B\u0442 \u0440\u0430\u0431\u043E\u0442\u044B 1.5 \u0433\u043E\u0434\u0430
skills.experience.content=\u042F \u0437\u0430\u043D\u0438\u043C\u0430\u044E\u0441\u044C \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u043D\u0430 Java \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0435 3 \
  \u043B\u0435\u0442, \u0438\u0437 \u043D\u0438\u0445 1.5 \u0433\u043E\u0434\u0430 \u043A\u043E\u043C\u043C\u0435\u0440\u0447\u0435\u0441\u043A\u043E\u0439 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u043E\u0439. 9 \u043C\u0435\u0441\u044F\u0446\u0435\u0432 \u0440\u0430\u0431\u043E\u0442\u0430\u043B \u0432 \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u0438 \
  Simplex Software \u043D\u0430 \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u0438 \u043C\u043B\u0430\u0434\u0448\u0435\u0433\u043E Java \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0441\u0442\u0430. \u041F\u043E\u0441\u043B\u0435, \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0435 \u0435\u0449\u0435 10 \
  \u043C\u0435\u0441\u044F\u0446\u0435\u0432 \u044F \u0437\u0430\u043D\u0438\u043C\u0430\u043B\u0441\u044F \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u043E\u0439 \u0438 \u0434\u043E\u0440\u0430\u0431\u043E\u0442\u043A\u043E\u0439 \u043E\u0434\u043D\u043E\u0438\u043C\u0435\u043D\u043D\u043E\u0433\u043E \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u0444\u0438\u0440\u043C\u044B \
  IQManager (\u0447\u0430\u0441\u0442\u0438\u0447\u043D\u0430\u044F \u0437\u0430\u043D\u044F\u0442\u043E\u0441\u0442\u044C, \u043D\u0435\u043E\u0444\u0438\u0446\u0438\u0430\u043B\u044C\u043D\u043E\u0435 \u0442\u0440\u0443\u0434\u043E\u0443\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u043E).
skills.english.title=Upper Intermediate English
skills.english.content=\u0423 \u043C\u0435\u043D\u044F \u0445\u043E\u0440\u043E\u0448\u0438\u0439 \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440\u043D\u044B\u0439 \u0438 \u043F\u0438\u0441\u044C\u043C\u0435\u043D\u043D\u044B\u0439 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439 \u044F\u0437\u044B\u043A \
  \u043D\u0430 \u0443\u0440\u043E\u0432\u043D\u0435 Upper Intermediate (B2). \u0412 \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0435 \u0440\u0430\u0431\u043E\u0442\u044B \u044F \u043D\u0435 \u0438\u0441\u043F\u044B\u0442\u044B\u0432\u0430\u044E \
  \u0442\u0440\u0443\u0434\u043D\u043E\u0441\u0442\u0435\u0439 \u0441 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0435\u0439 \u043D\u0430 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u043E\u043C \u044F\u0437\u044B\u043A\u0435.
skills.english.more.content=\u0414\u0432\u0430\u0436\u0434\u044B \u0431\u044B\u043B \u0432 \u0410\u043D\u0433\u043B\u0438\u0438 \u0432 \u044F\u0437\u044B\u043A\u043E\u0432\u044B\u0445 \u0448\u043A\u043E\u043B\u0430\u0445 (2010 \u0438 \
  2012\u0433), \u043E\u0434\u0438\u043D \u0440\u0430\u0437 \u043D\u0430 \u041C\u0430\u043B\u044C\u0442\u0435 (2011\u0433). \u0412 2013\u0433 \u044F \u043F\u043E\u043B\u0443\u0447\u0438\u043B \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043A\u0430\u0442 FCE (\u041F\u0435\u0440\u0432\u044B\u0439 \
  \u041A\u0435\u043C\u0431\u0440\u0438\u0434\u0436\u0441\u043A\u0438\u0439 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043A\u0430\u0442), \u0441\u0434\u0430\u043D\u043D\u044B\u0439 \u043D\u0430 \u043E\u0446\u0435\u043D\u043A\u0443 B, \u0447\u0442\u043E \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0443\u0440\u043E\u0432\u043D\u044E \
  \u0432\u043B\u0430\u0434\u0435\u043D\u0438\u044F \u044F\u0437\u044B\u043A\u043E\u043C B2.
skills.algorithms.title=\u0410\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u044B \u0438 \u0441\u0442\u0440\u0443\u043A\u0442\u0443\u0440\u044B \u0434\u0430\u043D\u043D\u044B\u0445
skills.algorithms.content=\u042F \u0437\u043D\u0430\u044E \u043E\u0441\u043D\u043E\u0432\u043D\u044B\u0435 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u044B \u0438 \u0441\u0442\u0440\u0443\u043A\u0442\u0443\u0440\u044B \u0434\u0430\u043D\u043D\u044B\u0445, \u043C\u043E\u0433\u0443 \
  \u043F\u0440\u043E\u0432\u0435\u0441\u0442\u0438 \u043E\u0446\u0435\u043D\u043A\u0443 \u0441\u043B\u043E\u0436\u043D\u043E\u0441\u0442\u0438 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u0430, \u0438\u043C\u0435\u044E \u0445\u043E\u0440\u043E\u0448\u0443\u044E \u043C\u0430\u0442\u0435\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0443\u044E \u0431\u0430\u0437\u0443. \u0422\u0430\u043A\u0436\u0435 \
  \u044F \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0438\u0437\u0443\u0447\u0430\u043B \u0443\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u043E \u043D\u0435\u0439\u0440\u043E\u043D\u043D\u044B\u0445 \u0441\u0435\u0442\u0435\u0439, \u043D\u043E \u043A \u0441\u043E\u0436\u0430\u043B\u0435\u043D\u0438\u044E \u043C\u043E\u0438 \
  \u0437\u043D\u0430\u043D\u0438\u044F \u0432 \u044D\u0442\u043E\u043C \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0438 \u043F\u043E\u043A\u0430 \u043D\u0435 \u043F\u043E\u0434\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u044B \u043F\u0440\u0430\u043A\u0442\u0438\u043A\u043E\u0439.
skills.algorithms.more.content=\u042F \u0438\u0437\u0443\u0447\u0430\u043B \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u044B \u0438 \u0441\u0442\u0443\u043A\u0442\u0443\u0440\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u043F\u043E \
  \u043E\u043D\u043B\u0430\u0439\u043D-\u043A\u0443\u0440\u0441\u0430\u043C Stepic. \u0421\u0441\u044B\u043B\u043A\u0438 \u043D\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u044B: \
  <div class="list-group my-2"> \
  <a href="https://stepik.org/cert/187216" target="_blank" class="list-group-item list-group-item-action py-1">\u0410\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u044B: \u0442\u0435\u043E\u0440\u0438\u044F \u0438 \u043F\u0440\u0430\u043A\u0442\u0438\u043A\u0430. \u041C\u0435\u0442\u043E\u0434\u044B</a> \
  <a href="https://stepik.org/cert/194175" target="_blank" class="list-group-item list-group-item-action py-1">\u0410\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u044B: \u0442\u0435\u043E\u0440\u0438\u044F \u0438 \u043F\u0440\u0430\u043A\u0442\u0438\u043A\u0430. \u0421\u0442\u0440\u0443\u043A\u0442\u0443\u0440\u044B \u0434\u0430\u043D\u043D\u044B\u0445</a> \
  </div> \
  \u0418\u0437\u0443\u0447\u0435\u043D\u043D\u044B\u0435 \u043C\u043D\u043E\u0439 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u044B \u0438 \u0441\u0442\u0440\u0443\u043A\u0442\u0443\u0440\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0431\u044B\u043B\u0438 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u044B \u0438 \u0441\u043E\u0431\u0440\u0430\u043D\u044B \u0432 \
  <a href="https://github.com/Anshelen/algorithms-explore" target="_blank">\u0440\u0435\u043F\u043E\u0437\u0438\u0442\u043E\u0440\u0438\u0438</a>.
skills.soft-skills.title=\u041C\u044F\u0433\u043A\u0438\u0435 \u043D\u0430\u0432\u044B\u043A\u0438
skills.soft-skills.content=\u042F \u0438\u043C\u0435\u044E \u043E\u043F\u044B\u0442 \u0440\u0430\u0431\u043E\u0442\u044B \u0432 \u043A\u043E\u043C\u0430\u043D\u0434\u0435, \u0430 \u0442\u0430\u043A\u0436\u0435 \u0438\u043C\u0435\u044E \u043E\u043F\u044B\u0442 \
  \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u043C \u0438 \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u043E\u0439 \u043A\u043E\u043C\u0430\u043D\u0434\u043E\u0439 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u043E\u0432. \u0412 \u043C\u043E\u0438 \u043E\u0431\u044F\u0437\u0430\u043D\u043D\u043E\u0441\u0442\u0438 \
  \u0432\u0445\u043E\u0434\u0438\u043B\u0438 \u0440\u0435\u0432\u044C\u044E \u043A\u043E\u0434\u0430 \u0434\u0440\u0443\u0433\u0438\u0445 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u043E\u0432, \u043E\u0446\u0435\u043D\u043A\u0430 \u0432\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0445 \u0437\u0430\u0442\u0440\u0430\u0442 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432, \u0430 \
  \u0442\u0430\u043A\u0436\u0435 \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u0437\u0430\u0434\u0430\u0447\u0430\u043C\u0438 \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u044B Redmine (\u0430\u043D\u0430\u043B\u043E\u0433 Jira).
skills.service.title=\u0421\u0435\u0440\u0432\u0438\u0441\u043D\u044B\u0439 \u0441\u043B\u043E\u0439 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F
skills.java.title=Java
skills.java.content=\u041C\u043E\u0439 \u043E\u0441\u043D\u043E\u0432\u043D\u043E\u0439 \u044F\u0437\u044B\u043A \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044E Java 8.
skills.java.more.content=\u042F \u0437\u043D\u0430\u044E \u043F\u0430\u0442\u0442\u0435\u0440\u043D\u044B \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438, \u0432\u043B\u0430\u0434\u0435\u044E \u041E\u041E\u041F, \u0438\u043C\u0435\u044E \u043E\u043F\u044B\u0442 \u0432 \
  \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0435 \u0438 \u043E\u0442\u043B\u0430\u0434\u043A\u0435 \u043C\u043D\u043E\u0433\u043E\u043F\u043E\u0442\u043E\u0447\u043D\u043E\u0433\u043E \u043A\u043E\u0434\u0430. \u0422\u0430\u043A\u0436\u0435 \u0438\u043C\u0435\u043B \u0434\u0435\u043B\u043E \u0441 \u043F\u0440\u043E\u0444\u0438\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435\u043C \
  \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u0442\u0430\u043A\u0438\u0445 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C, \u043A\u0430\u043A VisualVM, YourKit Java Profiler.
skills.spring.title=Spring Framework
skills.spring.content=\u0423\u043D\u0438\u0432\u0435\u0440\u0441\u0430\u043B\u044C\u043D\u044B\u0439 \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A, \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u044E\u0449\u0438\u0439 IoC \u0438 DI \u0438 \
  \u043C\u043D\u043E\u0433\u0438\u0435 \u0434\u0440\u0443\u0433\u0438\u0435 \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u0438, \u0442\u0430\u043A\u0438\u0435 \u043A\u0430\u043A \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u044F\u043C\u0438 \
  \u0438 \u0443\u043F\u0440\u043E\u0449\u0435\u043D\u0438\u0435 \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F.
skills.spring-data.title=Spring Data JPA
skills.spring-data.content=\u041C\u043E\u0434\u0443\u043B\u044C Spring, \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u044E\u0449\u0438\u0439 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u043D\u044B\u0435 \
  \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u0438 \u0432\u0437\u0430\u0438\u043C\u043E\u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0441 ORM-\u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A\u043E\u043C, \u0442\u0430\u043A\u0438\u043C \u043A\u0430\u043A Hibernate.
skills.spring-security.title=Spring Security
skills.spring-security.content=\u041C\u043E\u0434\u0443\u043B\u044C Spring, \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0449\u0438\u0439 \u043C\u0435\u0445\u0430\u043D\u0438\u0437\u043C\u044B \
  \u043F\u043E\u0441\u0442\u0440\u043E\u0435\u043D\u0438\u044F \u0441\u0438\u0441\u0442\u0435\u043C \u0430\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 \u0438 \u0430\u0432\u0442\u043E\u0440\u0438\u0437\u0430\u0446\u0438\u0438, \u0430 \u0442\u0430\u043A\u0436\u0435 \u0434\u0440\u0443\u0433\u0438\u0435 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u0438 \
  \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D\u0438\u044F \u0431\u0435\u0437\u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0434\u043B\u044F \u043F\u0440\u043E\u043C\u044B\u0448\u043B\u0435\u043D\u043D\u044B\u0445 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0439.
skills.spring-boot.title=Spring Boot
skills.spring-boot.content=\u041C\u043E\u0434\u0443\u043B\u044C Spring \u0434\u043B\u044F \u0431\u044B\u0441\u0442\u0440\u043E\u0439 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u0438 \u0440\u0430\u0437\u0432\u0435\u0440\u0442\u044B\u0432\u0430\u043D\u0438\u044F \
  \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0439. \u0422\u0430\u043A\u0436\u0435 \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0440\u044F\u0434 \u0440\u0435\u0448\u0435\u043D\u0438\u0439 \u0434\u043B\u044F \u043F\u043E\u0432\u044B\u0448\u0435\u043D\u0438\u044F \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438 \
  \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438, \u0442\u0430\u043A\u0438\u0445 \u043A\u0430\u043A LiveReload \u0438 Hot Restart.
skills.spring-mvc.title=Spring MVC
skills.spring-mvc.content=\u041C\u043E\u0434\u0443\u043B\u044C \u0434\u043B\u044F \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u0438 \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u0443\u0440\u044B \
  \u043C\u043E\u0434\u0435\u043B\u044C-\u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0435-\u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440 (model-view-controller). \u041E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u0435\u0442 \
  \u0433\u043E\u0442\u043E\u0432\u044B\u0435 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043C\u043E\u0433\u0443\u0442 \u0431\u044B\u0442\u044C \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u044B \u0434\u043B\u044F \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \
  \u0432\u0435\u0431-\u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0439.
skills.database.title=\u0421\u043B\u043E\u0439 \u0431\u0430\u0437 \u0434\u0430\u043D\u043D\u044B\u0445 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F
skills.postgresql.title=PostgreSQL
skills.postgresql.content=\u0421\u0432\u043E\u0431\u043E\u0434\u043D\u0430\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u043D\u043E-\u0440\u0435\u043B\u044F\u0446\u0438\u043E\u043D\u043D\u0430\u044F \u0441\u0438\u0441\u0442\u0435\u043C\u0430 \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F \
  \u0431\u0430\u0437\u0430\u043C\u0438 \u0434\u0430\u043D\u043D\u044B\u0445. \u042F \u0438\u043C\u0435\u044E \u043E\u043F\u044B\u0442 \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0437\u0430\u043F\u0440\u043E\u0441\u043E\u0432, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043F\u0440\u043E\u0435\u043A\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \
  \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u0438\u0445 \u0411\u0414.
skills.postgresql.more.content=\u042D\u0442\u043E \u0435\u0434\u0438\u043D\u0441\u0442\u0432\u0435\u043D\u043D\u0430\u044F \u0421\u0423\u0411\u0414, \u0441 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u044F \u0438\u043C\u0435\u043B \u0434\u0435\u043B\u043E. \u0423 \
  \u043C\u0435\u043D\u044F \u0435\u0441\u0442\u044C \u043E\u043F\u044B\u0442 \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u0438\u044F SQL \u0437\u0430\u043F\u0440\u043E\u0441\u043E\u0432 \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u043E\u0439 \u0441\u043B\u043E\u0436\u043D\u043E\u0441\u0442\u0438, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043E\u043F\u044B\u0442 \
  \u0440\u0430\u0431\u043E\u0442\u044B \u0441\u043E \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u0447\u043D\u044B\u043C\u0438 \u0434\u043B\u044F PostgreSQL \u0442\u0438\u043F\u0430\u043C\u0438 (\u2116 inet, enums, arrays). \u0412 \
  \u0440\u0430\u0431\u043E\u0442\u0435 \u043C\u043D\u0435 \u043D\u0435 \u0440\u0430\u0437 \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u043B\u043E\u0441\u044C \u043F\u0438\u0441\u0430\u0442\u044C \u0437\u0430\u043F\u0440\u043E\u0441\u044B \u0432 \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u043D\u043E\u043C \u0441\u0442\u0438\u043B\u0435 \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \
  \u044F\u0437\u044B\u043A\u043E\u0432\u043E\u0433\u043E \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u044F PL/pgSQL.
skills.hibernate.title=Hibernate
skills.hibernate.content=\u0420\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F JPA \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438, \u043F\u0440\u0435\u0434\u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u043D\u0430\u044F \u0434\u043B\u044F \
  \u0440\u0435\u0448\u0435\u043D\u0438\u044F \u0437\u0430\u0434\u0430\u0447 \u043E\u0431\u044A\u0435\u043A\u0442\u043D\u043E-\u0440\u0435\u043B\u044F\u0446\u0438\u043E\u043D\u043D\u043E\u0433\u043E \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u044F.
skills.hibernate.more.content=\u0418\u0437 \u0432\u0441\u0435\u0445 \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u0445 \u043C\u043D\u0435 \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A\u043E\u0432, \u0434\u0443\u043C\u0430\u044E, \
  Hibernate \u044F \u0437\u043D\u0430\u044E \u043B\u0443\u0447\u0448\u0435 \u0432\u0441\u0435\u0433\u043E. \u0412 \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0435 \u0440\u0430\u0431\u043E\u0442\u044B \u044F \u0438\u043C\u0435\u043B \u0434\u0435\u043B\u043E \u0441 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0446\u0438\u0435\u0439 \
  \u0437\u0430\u043F\u0440\u043E\u0441\u043E\u0432, \u0438\u043C\u0435\u044E \u043E\u043F\u044B\u0442 \u0432 \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438 \u0430\u0434\u0430\u043F\u0442\u0435\u0440\u043E\u0432 \u0434\u043B\u044F \u0440\u0430\u0431\u043E\u0442\u044B \u0441\u043E \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u0447\u043D\u044B\u043C\u0438 \u0434\u043B\u044F \
  PostgreSQL \u0442\u0438\u043F\u0430\u043C\u0438.
skills.hibernate-envers.title=Hibernate Envers
skills.hibernate-envers.content=\u041C\u043E\u0434\u0443\u043B\u044C Hibernate, \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0449\u0438\u0439 \u043E\u0442\u0441\u043B\u0435\u0436\u0438\u0432\u0430\u0442\u044C \
  \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0435 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u0435\u0439. \u041D\u0443\u0436\u0435\u043D \u0434\u043B\u044F \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u0435\u043D\u0438\u044F \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u044F \u043D\u0430\u0434 \u0442\u0430\u043A\u0438\u043C\u0438 \
  \u043A\u0440\u0438\u0442\u0438\u0447\u0435\u0441\u043A\u0438\u043C\u0438 \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u0430\u043C\u0438 \u043A\u0430\u043A \u043F\u043B\u0430\u0442\u0435\u0436\u0438 \u0438 \u043F\u0440\u0430\u0432\u0430, \u0430 \u0442\u0430\u043A\u0436\u0435 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \
  \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439/\u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u043E\u0432.
skills.hibernate-envers.more.content.part1=\u0421 \u043F\u043E\u043C\u043E\u0449\u044C\u044E Hibernate Envers \u044F \
  \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u044B\u0432\u0430\u043B \u0430\u0443\u0434\u0438\u0442 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0439 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439 \u0432 \u043F\u0440\u043E\u0435\u043A\u0442\u0435
skills.hibernate-envers.more.content.part2=\u041C\u043D\u043E\u0439 \u0431\u044B\u043B\u0430 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u0430 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \
  \u0430\u0443\u0434\u0438\u0442\u0430 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u0435\u0439 \u0441\u043E\u0433\u043B\u0430\u0441\u043D\u043E \u0443\u0441\u043B\u043E\u0432\u0438\u044F\u043C (conditional auditing).
skills.hibernate-search.title=Hibernate Search
skills.hibernate-search.content=\u041C\u043E\u0434\u0443\u043B\u044C Hibernate \u0434\u043B\u044F \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u0435\u043D\u0438\u044F \
  \u043F\u043E\u043B\u043D\u043E\u0442\u0435\u043A\u0441\u0442\u043E\u0432\u043E\u0433\u043E \u043F\u043E\u0438\u0441\u043A\u0430 (\u043D\u0430\u0434\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043D\u0430\u0434 Apache Lucene).
skills.hibernate-search.more.content=\u042F \u0438\u043C\u0435\u044E \u043E\u043F\u044B\u0442 \u0432 \u0441\u043E\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0438 \u0430\u043D\u0430\u043B\u0438\u0437\u0430\u0442\u043E\u0440\u043E\u0432 \
  \u043F\u043E\u043B\u043D\u043E\u0442\u0435\u043A\u0441\u0442\u043E\u0432\u043E\u0433\u043E \u043F\u043E\u0438\u0441\u043A\u0430, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0437\u0430\u043F\u0440\u043E\u0441\u043E\u0432 \u043A \u043D\u0438\u043C. \u0422\u0430\u043A\u0436\u0435 \u044F \
  \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u044F\u043B \u0434\u043E\u0440\u0430\u0431\u043E\u0442\u043A\u0443 \u0430\u043D\u0430\u043B\u0438\u0437\u0430\u0442\u043E\u0440\u0430, \u0430\u043D\u0430\u043B\u0438\u0437\u0438\u0440\u0443\u044F \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0435 \u0438\u043D\u0434\u0435\u043A\u0441\u0430 \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \
  \u043C\u043E\u0434\u0443\u043B\u044F luke.
skills.hibernate-validator.title=Hibernate Validator
skills.hibernate-validator.content=\u041C\u043E\u0434\u0443\u043B\u044C Hibernate \u0434\u043B\u044F \u043F\u0440\u043E\u0432\u0435\u0440\u043A\u0438 \u0432\u0435\u0440\u043D\u043E\u0441\u0442\u0438 \u0438 \
  \u0446\u0435\u043B\u043E\u0441\u0442\u043D\u043E\u0441\u0442\u0438 \u0434\u0430\u043D\u043D\u044B\u0445 \u0441\u043E\u0433\u043B\u0430\u0441\u043D\u043E \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 JSR 380 (Bean Validation 2.0).
skills.flyway.title=Flyway
skills.flyway.content=\u0411\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430, \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u044E\u0449\u0430\u044F \u0432\u0435\u0440\u0441\u0438\u043E\u043D\u043D\u043E\u0441\u0442\u044C \u0438 \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \
  \u043C\u0438\u0433\u0440\u0430\u0446\u0438\u044F\u043C\u0438 \u0431\u0430\u0437 \u0434\u0430\u043D\u043D\u044B\u0445. \u041D\u0443\u0436\u043D\u0430 \u0434\u043B\u044F \u0441\u0438\u043D\u0445\u0440\u043E\u043D\u0438\u0437\u0430\u0446\u0438\u0438 \u0441\u043E\u0441\u0442\u043E\u044F\u043D\u0438\u044F \u0411\u0414 \u0443 \u0432\u0441\u0435\u0439 \u043A\u043E\u043C\u0430\u043D\u0434\u044B \
  \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u043E\u0432.
skills.presentations-generation.title=\u0422\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438 \u0433\u0435\u043D\u0435\u0440\u0430\u0446\u0438\u0438 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0439
skills.thymeleaf.title=Thymeleaf
skills.thymeleaf.content=\u0421\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0439 \u0441\u0435\u0440\u0432\u0435\u0440\u043D\u044B\u0439 \u043C\u0435\u0445\u0430\u043D\u0438\u0437\u043C Java-\u0448\u0430\u0431\u043B\u043E\u043D\u043E\u0432. \u041E\u0442\u043B\u0438\u0447\u043D\u043E \
  \u0432\u0437\u0430\u0438\u043C\u043E\u0434\u0435\u0439\u0441\u0442\u0432\u0443\u0435\u0442 \u0441\u043E Spring \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u044F\u043C\u0438.
skills.jsp.title=JSP
skills.jsp.content=\u0422\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u044F, \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0449\u0430\u044F \u0432\u0435\u0431-\u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0430\u043C \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \
  \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0435, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0438\u043C\u0435\u0435\u0442 \u043A\u0430\u043A \u0441\u0442\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438\u0435, \u0442\u0430\u043A \u0438 \u0434\u0438\u043D\u0430\u043C\u0438\u0447\u0435\u0441\u043A\u0438\u0435 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B.
skills.wicket.title=Apache Wicket
skills.wicket.content=\u0412\u0435\u0431-\u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044E\u0449\u0438\u0439 \u043F\u043E\u0434\u0445\u043E\u0434, \u043E\u0441\u043D\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u043D\u0430 \
  \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0438 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u043E\u0432. \u041F\u043E\u0436\u0430\u043B\u0443\u0439, \u044D\u0442\u043E \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A, \u0432 \u043F\u0440\u0438\u043C\u0435\u043D\u0435\u043D\u0438\u0438 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u044F \
  \u0438\u043C\u0435\u044E \u0431\u043E\u043B\u044C\u0448\u0435 \u0432\u0441\u0435\u0433\u043E \u043E\u043F\u044B\u0442\u0430.
skills.wicket.more.content=<p> \u0412 \u043C\u043E\u0435\u0439 \u0440\u0430\u0431\u043E\u0442\u0435 \u0431\u043E\u043B\u044C\u0448\u0438\u043D\u0441\u0442\u0432\u043E \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432 \u0431\u044B\u043B\u0438 \
  \u043F\u043E\u0441\u0442\u0440\u043E\u0435\u043D\u044B \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u044D\u0442\u043E\u0433\u043E \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A\u0430. \u041D\u0430\u0438\u0431\u043E\u043B\u0435\u0435 \u0441\u043B\u043E\u0436\u043D\u044B\u043C\u0438 \u0437\u0430\u0434\u0430\u0447\u0430\u043C\u0438, \u0441 \
  \u043A\u043E\u0442\u043E\u0440\u044B\u043C\u0438 \u044F \u0441\u0442\u0430\u043B\u043A\u0438\u0432\u0430\u043B\u0441\u044F, \u0431\u044B\u043B\u0430 \u0438\u043D\u0442\u0435\u0433\u0440\u0430\u0446\u0438\u044F Wicket'\u0430 \u0441 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u0430\u043C\u0438, \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u043D\u044B\u043C\u0438 \
  \u043D\u0430 JS (\u2116 \u043A\u0430\u043B\u0435\u043D\u0434\u0430\u0440\u0438, \u043A\u0430\u0440\u0442\u044B).</p> \
  <p>\u0422\u0430\u043A\u0436\u0435 \u044F \u0443\u0447\u0430\u0432\u0441\u0442\u0432\u043E\u0432\u0430\u043B \u0432 \u0434\u043E\u0440\u0430\u0431\u043E\u0442\u043A\u0435 \u043C\u043E\u0434\u0435\u043B\u0435\u0439 \u0434\u043B\u044F \u0440\u0430\u0431\u043E\u0442\u044B \u0441 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u044F\u043C\u0438 Hibernate \
  \u0432 \u0440\u0430\u043C\u043A\u0430\u0445 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0438 <a href="https://sourceforge.net/projects/wicket-autodao/" target="_blank">wicket-autodao</a>. \
  </p> \
  <p>\u041F\u043E \u043C\u043E\u0435\u043C\u0443 \u043E\u043F\u044B\u0442\u0443 Wicket \u0445\u043E\u0440\u043E\u0448\u043E \u043F\u043E\u0434\u0445\u043E\u0434\u0438\u0442 \u0434\u043B\u044F \u043F\u0440\u043E\u0441\u0442\u044B\u0445 \u0441\u0430\u0439\u0442\u043E\u0432. \u0414\u043B\u044F \u0431\u043E\u043B\u0435\u0435 \
  \u0433\u043B\u043E\u0431\u0430\u043B\u044C\u043D\u044B\u0445 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435 \u044D\u0442\u043E\u0433\u043E \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A\u0430 \u0432\u0435\u0434\u0435\u0442 \u043A \u0431\u044B\u0441\u0442\u0440\u043E\u0439 \
  \u0434\u0435\u0433\u0440\u0430\u0434\u0430\u0446\u0438\u0438 \u043A\u043E\u0434\u043E\u0432\u043E\u0439 \u0431\u0430\u0437\u044B \u0438 \u043F\u043E\u044F\u0432\u043B\u0435\u043D\u0438\u044E \u0431\u043E\u043B\u044C\u0448\u043E\u0433\u043E \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u0430 \u0441\u043F\u0430\u0433\u0435\u0442\u0442\u0438-\u043A\u043E\u0434\u0430. \u042D\u0442\u043E\u0442 \
  \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A \u0442\u0440\u0435\u0431\u0443\u0435\u0442 \u0442\u0432\u0435\u0440\u0434\u044B\u0445 \u043C\u0435\u0442\u043E\u0434\u0438\u043A \u043A\u043E\u0434\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F.</p>
skills.zk.title=Zk Framework
skills.zk.content=\u0424\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A \u0434\u043B\u044F \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u0432\u0435\u0431-\u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0439 \u0432 \
  \u0441\u043E\u0431\u044B\u0442\u0438\u0439\u043D\u043E-\u043E\u0440\u0438\u0435\u043D\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0439 \u043F\u0430\u0440\u0430\u0434\u0438\u0433\u043C\u0435 \u0438 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u043D\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438. \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043F\u0438\u0441\u0430\u0442\u044C \
  \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u044B \u0432 \u0441\u0442\u0438\u043B\u0435 MVVM, \u0447\u0442\u043E \u0437\u0430\u043C\u0435\u0442\u043D\u043E \u0443\u0441\u043A\u043E\u0440\u044F\u0435\u0442 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0443 \u0432 \u0443\u0449\u0435\u0440\u0431 \
  \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438. \u041F\u043E\u044D\u0442\u043E\u043C\u0443 \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0440\u0430\u0431\u043E\u0442\u044B \u044D\u0442\u043E\u0442 \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A \u0443 \u043D\u0430\u0441 \
  \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043B\u0441\u044F \u0432 \u043E\u0441\u043D\u043E\u0432\u043D\u043E\u043C \u0434\u043B\u044F \u0430\u0434\u043C\u0438\u043D\u043E\u043A \u0438\u043B\u0438 \u0432\u043D\u0443\u0442\u0440\u0438\u043A\u043E\u0440\u043F\u043E\u0440\u0430\u0442\u0438\u0432\u043D\u044B\u0445 \u0441\u0430\u0439\u0442\u043E\u0432.
skills.frontend.title=\u0424\u0440\u043E\u043D\u0442\u0435\u043D\u0434
skills.javascript.title=Javascript
skills.javascript.content=\u042F\u0437\u044B\u043A \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F, \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u044B \
  \u0441\u0430\u0439\u0442\u043E\u0432 \u0441\u0442\u0430\u043D\u043E\u0432\u044F\u0442\u0441\u044F \u0438\u043D\u0442\u0435\u0440\u0430\u043A\u0442\u0438\u0432\u043D\u044B\u043C\u0438.
skills.javascript.more.content=\u042F \u0437\u043D\u0430\u043A\u043E\u043C \u0441\u043E \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0435\u0439 ES6. \u0423 \u043C\u0435\u043D\u044F \u0435\u0441\u0442\u044C \u043E\u043F\u044B\u0442 \
  \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u043A\u0430\u043B\u0435\u043D\u0434\u0430\u0440\u044F \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u041E\u041E\u041F \u0432 \u043F\u0440\u043E\u0442\u043E\u0442\u0438\u043F\u043D\u043E\u043C \u0441\u0442\u0438\u043B\u0435, \u0430 \u0442\u0430\u043A\u0436\u0435 \
  \u0440\u0430\u0431\u043E\u0442\u044B \u0441 Google Maps API.
skills.html.title=HTML 5
skills.html.content=\u042F\u0437\u044B\u043A \u0434\u043B\u044F \u0441\u0442\u0440\u0443\u043A\u0442\u0443\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0438 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u044F \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0433\u043E \
  \u0432\u0441\u0435\u043C\u0438\u0440\u043D\u043E\u0439 \u043F\u0430\u0443\u0442\u0438\u043D\u044B.
skills.css.title=CSS 3
skills.css.content=\u042F\u0437\u044B\u043A \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0432\u043D\u0435\u0448\u043D\u0435\u0433\u043E \u0432\u0438\u0434\u0430 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430, \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u043D\u043E\u0433\u043E \u0441 \
  \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u044F\u0437\u044B\u043A\u0430 \u0440\u0430\u0437\u043C\u0435\u0442\u043A\u0438.
skills.bootstrap.title=Bootstrap 4
skills.bootstrap.content=\u0421\u0432\u043E\u0431\u043E\u0434\u043D\u044B\u0439 \u043D\u0430\u0431\u043E\u0440 \u0438\u043D\u0441\u0442\u0440\u0443\u043C\u0435\u043D\u0442\u043E\u0432 \u0434\u043B\u044F \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F \u0441\u0430\u0439\u0442\u043E\u0432 \u0438 \
  \u0432\u0435\u0431-\u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0439. \u042D\u0442\u043E\u0442 \u0441\u0430\u0439\u0442 \u0441\u0434\u0435\u043B\u0430\u043D \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C Bootstrap 4.
skills.jquery.title=jQuery
skills.jquery.content=\u0411\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430 JavaScript, \u043E\u0431\u043B\u0435\u0433\u0447\u0430\u044E\u0449\u0430\u044F \u0434\u043E\u0441\u0442\u0443\u043F \u0438 \u043C\u0430\u043D\u0438\u043F\u0443\u043B\u044F\u044E\u0446\u0438\u044E \
  \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u0430\u043C\u0438 DOM. \u0422\u0430\u043A\u0436\u0435 \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0443\u0434\u043E\u0431\u043D\u044B\u0439 API \u0434\u043B\u044F \u0440\u0430\u0431\u043E\u0442\u044B \u0441 AJAX.
skills.testing.title=\u0422\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435
skills.junit.title=JUnit
skills.junit.content=\u0411\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430 \u0434\u043B\u044F \u043C\u043E\u0434\u0443\u043B\u044C\u043D\u043E\u0433\u043E \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u043D\u043E\u0433\u043E \
  \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D\u0438\u044F. \u042F \u0440\u0430\u0431\u043E\u0442\u0430\u043B \u043A\u0430\u043A \u0441 4, \u0442\u0430\u043A \u0438 \u0441 5 \u0432\u0435\u0440\u0441\u0438\u044F\u043C\u0438 \u044D\u0442\u043E\u0433\u043E \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A\u0430.
skills.mockito.title=Mockito
skills.mockito.content=\u0424\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A, \u0443\u043F\u0440\u043E\u0449\u0430\u044E\u0449\u0438\u0439 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u0435 \u0437\u0430\u0433\u043B\u0443\u0448\u0435\u043A \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u043E\u0432 \
  \u0441\u0438\u0441\u0442\u0435\u043C\u044B \u0441 \u0437\u0430\u0440\u0430\u043D\u0435\u0435 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u043C \u043F\u043E\u0432\u0435\u0434\u0435\u043D\u0438\u0435\u043C.
skills.powermock.title=Powermock
skills.powermock.content=\u0424\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A, \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0449\u0438\u0439 \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u0438 \
  \u0434\u043B\u044F \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u0435 \u0437\u0430\u0433\u043B\u0443\u0448\u0435\u043A \u043F\u043E \u0441\u0440\u0430\u0432\u043D\u0435\u043D\u0438\u044E \u0441 Mockito (\u2116 \u0437\u0430\u0434\u0430\u0432\u0430\u0442\u044C \u043F\u043E\u0432\u0435\u0434\u0435\u043D\u0438\u0435 \u043F\u0440\u0438\u0432\u0430\u0442\u043D\u044B\u0445 \
  \u0438\u043B\u0438 \u0436\u0435 final \u043C\u0435\u0442\u043E\u0434\u043E\u0432).
skills.selenium.title=Selenium
skills.selenium.content=\u0411\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430, \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0449\u0430\u044F \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u0438 end-to-end \
  \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0432\u0435\u0431-\u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0430.
skills.blockchain.title=\u0411\u043B\u043E\u043A\u0447\u0435\u0439\u043D
skills.ethereum.title=Ethereum
skills.ethereum.content=\u0411\u043B\u043E\u043A\u0447\u0435\u0439\u043D-\u043F\u043B\u0430\u0442\u0444\u043E\u0440\u043C\u0430 \u0434\u043B\u044F \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F \u0434\u0435\u0446\u0435\u043D\u0442\u0440\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u043D\u044B\u0445 \
  \u043E\u043D\u043B\u0430\u0439\u043D-\u0441\u0435\u0440\u0432\u0438\u0441\u043E\u0432 \u043D\u0430 \u0431\u0430\u0437\u0435 \u0443\u043C\u043D\u044B\u0445 \u043A\u043E\u043D\u0442\u0440\u0430\u043A\u0442\u043E\u0432. \u0414\u043B\u044F \u0440\u0443\u0447\u043D\u043E\u0433\u043E \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \
  \u0441\u043C\u0430\u0440\u0442-\u043A\u043E\u043D\u0442\u0440\u0430\u043A\u0442\u043E\u0432 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043B\u0441\u044F \u0442\u0435\u0441\u0442\u043E\u0432\u044B\u0439 \u0431\u043B\u043E\u043A\u0447\u0435\u0439\u043D Rinkeby.
skills.solidity.title=Solidity
skills.solidity.content=\u041E\u0431\u044A\u0435\u043A\u0442\u043D\u043E-\u043E\u0440\u0438\u0435\u043D\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u044F\u0437\u044B\u043A \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \
  \u0441\u0430\u043C\u043E\u0432\u044B\u043F\u043E\u043B\u043D\u044F\u044E\u0449\u0438\u0445\u0441\u044F \u043A\u043E\u043D\u0442\u0440\u0430\u043A\u0442\u043E\u0432 \u0434\u043B\u044F \u043F\u043B\u0430\u0442\u0444\u043E\u0440\u043C\u044B Ethereum. De facto \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \
  \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043E\u043C \u0434\u043B\u044F \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0441\u043C\u0430\u0440\u0442-\u043A\u043E\u043D\u0442\u0440\u0430\u043A\u0442\u043E\u0432.
skills.solidity.more.content=\u041C\u043D\u043E\u0439 \u0431\u044B\u043B \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0430\u043D \u0441\u043C\u0430\u0440\u0442-\u043A\u043E\u043D\u0442\u0440\u0430\u043A\u0442 \u043E\u0431\u043C\u0435\u043D\u043D\u0438\u043A\u0430 \
  \u044D\u0444\u0438\u0440\u0430 \u043D\u0430 \u0442\u043E\u043A\u0435\u043D\u044B (\u0438 \u043D\u0430\u043E\u0431\u043E\u0440\u043E\u0442) \u043F\u0440\u0438 \u043F\u0440\u0438\u0432\u044F\u0437\u043A\u0435 \u0446\u0435\u043D\u044B \u043A \u0432\u043D\u0435\u0448\u043D\u0435\u043C\u0443 \u0444\u0430\u043A\u0442\u043E\u0440\u0443 (\u043A\u0443\u0440\u0441 \
  \u044D\u0444\u0438\u0440\u0430 \u043A \u0440\u0443\u0431\u043B\u044E). \u0414\u043B\u044F \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u0438\u044F \u043A\u0443\u0440\u0441\u0430 \u0434\u043E\u043B\u043B\u0430\u0440\u0430 \u0438\u0437\u043D\u0430\u0447\u0430\u043B\u044C\u043D\u043E \u0431\u044B\u043B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D \
  \u043E\u0440\u0430\u043A\u0443\u043B Oraclize, \u043E\u0434\u043D\u0430\u043A\u043E, \u0437\u0430\u0442\u0440\u0430\u0442\u044B \u043D\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u043D\u0438\u0435 \u043E\u0431\u043C\u0435\u043D\u043D\u0438\u043A\u0430 \u043E\u043A\u0430\u0437\u0430\u043B\u0438\u0441\u044C \u0434\u043B\u044F \
  \u0437\u0430\u043A\u0430\u0437\u0447\u0438\u043A\u0430 \u043D\u0435\u043F\u0440\u0438\u0435\u043C\u043B\u0435\u043C\u044B\u043C\u0438. \u0412 \u0438\u0442\u043E\u0433\u0435 \u0431\u044B\u043B\u043E \u043F\u0440\u0438\u043D\u044F\u0442\u043E \u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u0442\u044C \u0441\u0432\u043E\u0439 \
  \u0441\u0435\u0440\u0432\u0438\u0441-\u043E\u0440\u0430\u043A\u0443\u043B. \u042D\u0442\u043E \u043F\u043E\u0437\u0432\u043E\u043B\u0438\u043B\u043E \u0441\u043E\u043A\u0440\u0430\u0442\u0438\u0442\u044C \u0437\u0430\u0442\u0440\u0430\u0442\u044B \u043D\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u043D\u0438\u0435 \u043E\u0431\u043C\u0435\u043D\u043D\u0438\u043A\u0430 \u0432 4 \
  \u0440\u0430\u0437\u0430.
skills.web3j.title=Web3j
skills.web3j.content=\u0411\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430, \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0449\u0430\u044F Java API \u043A ethereum \u043D\u043E\u0434\u0435.
skills.web3j.more.content=\u041D\u0430 \u044D\u0442\u043E\u043C \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A\u0435 \u043C\u043D\u043E\u0439 \u0431\u044B\u043B \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0430\u043D \u043E\u0440\u0430\u043A\u0443\u043B \u0434\u043B\u044F \
  \u0438\u043D\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0441\u043C\u0430\u0440\u0442-\u043A\u043E\u043D\u0442\u0440\u0430\u043A\u0442\u0430 \u043E\u0431 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0438 \u0432\u043D\u0435\u0448\u043D\u0435\u0433\u043E \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u0430 (\u043A\u0443\u0440\u0441\u0430 \
  \u044D\u0444\u0438\u0440\u0430). \u0422\u0430\u043A\u0436\u0435 \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C Web3j \u044F \u0440\u0430\u0437\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u043B \u0442\u0435\u0441\u0442\u044B \u0434\u043B\u044F \u043F\u0440\u043E\u0435\u043A\u0442\u0430 (\u0417\u0410\u041E \u0441 \
  \u043A\u0440\u0438\u043F\u0442\u043E\u0432\u0430\u043B\u044E\u0442\u0430\u043C\u0438 \u0432 \u0440\u043E\u043B\u0438 \u0430\u043A\u0446\u0438\u0439) \u0441 \u043F\u043E\u0432\u044B\u0448\u0435\u043D\u043D\u044B\u043C\u0438 \u0442\u0440\u0435\u0431\u043E\u0432\u0430\u043D\u0438\u044F\u043C\u0438 \u043A \u043A\u043E\u0440\u0440\u0435\u043A\u0442\u043D\u043E\u0441\u0442\u0438 \
  \u0434\u0430\u043D\u043D\u044B\u0445. \u0422\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u043F\u0440\u043E\u0432\u043E\u0434\u0438\u043B\u043E\u0441\u044C \u0432 \u0442\u0435\u0441\u0442\u043E\u0432\u043E\u0439 \u0441\u0440\u0435\u0434\u0435 TestRPC, \u0430 \u0442\u0430\u043A\u0436\u0435 \u0432 \
  \u0442\u0435\u0441\u0442\u043E\u0432\u043E\u043C \u043F\u0440\u0438\u0432\u0430\u0442\u043D\u043E\u043C \u0431\u043B\u043E\u043A\u0447\u0435\u0439\u043D\u0435.
skills.tools.title=\u0412\u0441\u043F\u043E\u043C\u043E\u0433\u0430\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0438\u043D\u0441\u0442\u0440\u0443\u043C\u0435\u043D\u0442\u044B
skills.python.title=Python 3
skills.python.content=\u0418\u043D\u0442\u0435\u0440\u043F\u0440\u0435\u0442\u0438\u0440\u0443\u0435\u043C\u044B\u0439 \u044F\u0437\u044B\u043A \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043E\u0431\u0449\u0435\u0433\u043E \
  \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F. \u0423 \u043C\u0435\u043D\u044F \u043D\u0435\u0442 \u043E\u043F\u044B\u0442\u0430 \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u043F\u043E\u043B\u043D\u043E\u0446\u0435\u043D\u043D\u044B\u0445 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432 \u043D\u0430 Python, \u043D\u043E \u044F \
  \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043B \u0435\u0433\u043E \u0434\u043B\u044F \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0435\u0434\u0438\u043D\u043E\u0440\u0430\u0437\u043E\u0432\u044B\u0445 \u0441\u043A\u0440\u0438\u043F\u0442\u043E\u0432.
skills.python.more.content=\u042F \u0437\u043D\u0430\u044E \u043E\u0441\u043D\u043E\u0432\u044B \u044F\u0437\u044B\u043A\u0430, \u043F\u0440\u043E\u0447\u0435\u043B \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043A\u043D\u0438\u0433 \u043F\u043E \
  \u0434\u0430\u043D\u043D\u043E\u0439 \u0442\u0435\u043C\u0430\u0442\u0438\u043A\u0435 ("\u0418\u0437\u0443\u0447\u0430\u0435\u043C \u043F\u0438\u0442\u043E\u043D" \u041B\u0443\u0442\u0446\u0430 \u0438 "\u0423\u043A\u0443\u0441 \u043F\u0438\u0442\u043E\u043D\u0430" \u0421\u0432\u0430\u0440\u0443\u043F\u0430), \u0438\u0437\u0443\u0447\u0438\u043B \
  \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u0443\u044E \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0443. \u0418\u0437-\u0437\u0430 \u0435\u0433\u043E \u043F\u0440\u043E\u0441\u0442\u043E\u0442\u044B \u0438 \u0432\u044B\u0440\u0430\u0437\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438 \u044F \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043B \
  \u043F\u0438\u0442\u043E\u043D \u0434\u043B\u044F \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438 \u0438 \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u043E\u0432 \u0438 \u0441\u0442\u0440\u0443\u043A\u0442\u0443\u0440 \u0434\u0430\u043D\u043D\u044B\u0445. \u0422\u0430\u043A\u0436\u0435 \u0441 \
  \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u044D\u0442\u043E\u0433\u043E \u044F\u0437\u044B\u043A\u0430 \u044F \u043D\u0430\u043F\u0438\u0441\u0430\u043B \u0430\u043D\u0430\u043B\u0438\u0437\u0430\u0442\u043E\u0440 \u043B\u043E\u0433\u043E\u0432 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F, \u0430 \u0442\u0430\u043A\u0436\u0435 \
  <a href="https://github.com/Anshelen/thumbnails-gen">\u0441\u043A\u0440\u0438\u043F\u0442 \u0434\u043B\u044F \u0433\u0435\u043D\u0435\u0440\u0430\u0446\u0438\u0438 \
  \u0438\u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u0439-\u043C\u0438\u043D\u0438\u0430\u0442\u044E\u0440 (thumbnails) \u0441\u0430\u0439\u0442\u0430</a>.
skills.git.title=Git
skills.git.content=\u0421\u0438\u0441\u0442\u0435\u043C\u0430 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u044F \u0432\u0435\u0440\u0441\u0438\u0439.
skills.intellij-idea.title=IntelliJ IDEA
skills.intellij-idea.content=\u0421\u0440\u0435\u0434\u0430 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u0434\u043B\u044F Java.
skills.assembly.title=\u0421\u0431\u043E\u0440\u043A\u0430 \u0438 \u0440\u0430\u0437\u0432\u0435\u0440\u0442\u044B\u0432\u0430\u043D\u0438\u0435 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432
skills.maven.title=Maven
skills.maven.content=\u0424\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A \u0434\u043B\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0437\u0430\u0446\u0438\u0438 \u0441\u0431\u043E\u0440\u043A\u0438 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432. \u0412 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \
  \u0434\u043E\u043C\u0430\u0448\u043D\u0435\u0433\u043E \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u044F \u0441\u043E\u0437\u0434\u0430\u043B maven-\u0430\u0440\u0445\u0435\u0442\u0438\u043F \u0434\u043B\u044F \u0431\u044B\u0441\u0442\u0440\u043E\u0433\u043E \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F \
  \u0432\u0435\u0431-\u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0439 \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C Spring Boot + Thymeleaf.
skills.travis.title=Travis CI
skills.travis.content=\u0412\u0435\u0431-\u0441\u0435\u0440\u0432\u0438\u0441 \u0434\u043B\u044F \u0441\u0431\u043E\u0440\u043A\u0438 \u0438 \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u043D\u043E\u0433\u043E \
  \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D\u0438\u044F.
skills.tomcat.title=Apache Tomcat
skills.tomcat.content=\u041A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440 \u0441\u0435\u0440\u0432\u043B\u0435\u0442\u043E\u0432.
skills.heroku.title=Heroku
skills.heroku.content=Heroku - \u044D\u0442\u043E PaaS-\u043F\u043B\u0430\u0442\u0444\u043E\u0440\u043C\u0430, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \
  \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C, \u0437\u0430\u043F\u0443\u0441\u043A\u0430\u0442\u044C \u0438 \u044D\u043A\u0441\u043F\u043B\u0443\u0430\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0432 \u043E\u0431\u043B\u0430\u043A\u0435.
skills.auxiliary-technologies.title=\u0412\u0441\u043F\u043E\u043C\u043E\u0433\u0430\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0441\u0435\u0440\u0432\u0435\u0440\u043D\u044B\u0435 \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438
skills.slf4j.title=SLF4J + Logback
skills.slf4j.content=SLF4J - \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430 \u0434\u043B\u044F \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F, \u0441\u0442\u0430\u0432\u044F\u0449\u0430\u044F \u0441\u0432\u043E\u0435\u0439 \
  \u0446\u0435\u043B\u044C\u044E \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E \u043F\u0440\u043E\u0441\u0442\u043E\u0439, \u043D\u043E \u043F\u0440\u0438 \u044D\u0442\u043E\u043C \u043C\u043E\u0449\u043D\u044B\u0439 \u0444\u0430\u0441\u0430\u0434 \u0434\u043B\u044F \
  \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u044B\u0445 \u0441\u0438\u0441\u0442\u0435\u043C \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043D\u0430 Java. Logback - \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A \u043B\u043E\u0433\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F, \
  \u0440\u0435\u0430\u043B\u0438\u0437\u0443\u044E\u0449\u0438\u0439 \u044D\u0442\u043E\u0442 \u0444\u0430\u0441\u0430\u0434.
skills.quartz.title=Quartz
skills.quartz.content=Quartz \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0441\u043E\u0431\u043E\u0439 \u0441\u0440\u0435\u0434\u0443 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u0434\u043B\u044F \
  \u043F\u043B\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u0439 \u0441 \u043E\u0442\u043A\u0440\u044B\u0442\u044B\u043C \u0438\u0441\u0445\u043E\u0434\u043D\u044B\u043C \u043A\u043E\u0434\u043E\u043C, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u0435\u0442 \
  \u044D\u0444\u0444\u0435\u043A\u0442\u0438\u0432\u043D\u044B\u0439 \u043C\u0435\u0445\u0430\u043D\u0438\u0437\u043C \u043F\u043B\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u0439 \u0432 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F\u0445 Java. \u0418\u0437 \u043A\u043E\u0440\u043E\u0431\u043A\u0438 \
  \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u0445\u0440\u0430\u043D\u0435\u043D\u0438\u0435 \u0437\u0430\u0434\u0430\u0447 \u0438 \u0442\u0440\u0438\u0433\u0433\u0435\u0440\u043E\u0432 \u0432 \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445, \u0447\u0442\u043E \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \
  \u0433\u0430\u0440\u0430\u043D\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0438\u0445 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u0434\u0430\u0436\u0435 \u043F\u0440\u0438 \u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u043C \u043E\u0442\u043A\u0430\u0437\u0435 \u0441\u0438\u0441\u0442\u0435\u043C\u044B \u0438\u043B\u0438 \u0436\u0435 \u043F\u043E\u0441\u043B\u0435 \
  \u043F\u0435\u0440\u0435\u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.
skills.velocity.title=Apache Velocity
skills.velocity.content=\u041F\u0440\u043E\u0446\u0435\u0441\u0441\u043E\u0440 \u0448\u0430\u0431\u043B\u043E\u043D\u043E\u0432, \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0449\u0438\u0439 \u043F\u0440\u043E\u0441\u0442\u043E\u0439, \u043D\u043E \
  \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E \u0433\u0438\u0431\u043A\u0438\u0439 \u0448\u0430\u0431\u043B\u043E\u043D\u043D\u044B\u0439 \u044F\u0437\u044B\u043A. \u0412 \u043E\u0441\u043D\u043E\u0432\u043D\u043E\u043C \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043B\u0441\u044F \u043C\u043D\u043E\u0439 \u0434\u043B\u044F \
  \u0433\u0435\u043D\u0435\u0440\u0430\u0446\u0438\u0438 e-mail \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0439.
skills.jackson.title=Jackson
skills.jackson.content=Java \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430 \u0434\u043B\u044F \u0440\u0430\u0431\u043E\u0442\u044B \u0441 \u0434\u0430\u043D\u043D\u044B\u043C\u0438 \u0432 \u0444\u043E\u0440\u043C\u0430\u0442\u0435 JSON.
skills.jaxb.title=JAXB
skills.jaxb.content=Java \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430 \u0434\u043B\u044F \u0440\u0430\u0431\u043E\u0442\u044B \u0441 \u0434\u0430\u043D\u043D\u044B\u043C\u0438 \u0432 \u0444\u043E\u0440\u043C\u0430\u0442\u0435 XML.


javax.validation.constraints.NotBlank.message=\u041F\u043E\u043B\u0435 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043F\u0443\u0441\u0442\u044B\u043C
javax.validation.constraints.NotEmpty.message=\u041F\u043E\u043B\u0435 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043F\u0443\u0441\u0442\u044B\u043C
javax.validation.constraints.NotNull.message=\u041F\u043E\u043B\u0435 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043F\u0443\u0441\u0442\u044B\u043C
javax.validation.constraints.Email.message=\u0410\u0434\u0440\u0435\u0441 \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u043E\u0439 \u043F\u043E\u0447\u0442\u044B \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D \u0432 \u043D\u0435\u0432\u0435\u0440\u043D\u043E\u043C \u0444\u043E\u0440\u043C\u0430\u0442\u0435
javax.validation.constraints.PasswordMatches.message=\u0412\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0435 \u043F\u0430\u0440\u043E\u043B\u0438 \u043D\u0435 \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u044E\u0442
javax.validation.constraints.UniqueEmail.message=\u0410\u043A\u043A\u0430\u0443\u043D\u0442 \u0441 \u0442\u0430\u043A\u0438\u043C \u0430\u0434\u0440\u0435\u0441\u043E\u043C \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u043E\u0439 \u043F\u043E\u0447\u0442\u044B \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
javax.validation.constraints.Size.UserDTO.userName=\u0418\u043C\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0434\u043E\u043B\u0436\u043D\u043E \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u043D\u0435 \u043C\u0435\u043D\u0435\u0435 {min} \u0438 \u043D\u0435 \u0431\u043E\u043B\u0435\u0435 {max} \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432
javax.validation.constraints.Size.UserDTO.email=\u0410\u0434\u0440\u0435\u0441 \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u043E\u0439 \u043F\u043E\u0447\u0442\u044B \u0434\u043E\u043B\u0436\u0435\u043D \u0441\u043E\u0441\u0442\u043E\u044F\u0442\u044C \u0438\u0437 \u043C\u0430\u043A\u0441\u0438\u043C\u0443\u043C {max} \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432
javax.validation.constraints.Size.UserDTO.password=\u041F\u0430\u0440\u043E\u043B\u044C \u0434\u043E\u043B\u0436\u0435\u043D \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u043E\u0442 {min} \u0434\u043E {max} \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432
